{
  "summary": {
    "updated": 16,
    "errors": 0,
    "updatedAt": "2026-01-27T14:49:41.013Z"
  },
  "updates": [
    {
      "id": "695f7c0ffe74eb993b61fc37",
      "name": "My Dog Run Secure Dog Field",
      "newDescription": "My Dog Run offers fully fenced secure dog fields across multiple locations including Stewkley, Eaton Bray, and others in Bedfordshire and Buckinghamshire. Each field is enclosed with 6ft fine mesh fencing with fenced off-road parking for added safety. Only one booking per time slot ensures exclusive use, making it ideal for nervous, antisocial, or recall-training dogs. Sessions are available in 25-minute and 55-minute slots with a 5-minute crossover. Rustic obstacles and a shelter are provided on site."
    },
    {
      "id": "695f7c14fe74eb993b61fc5a",
      "name": "Florey's Field Secure Dog Walking Paddock",
      "newDescription": "Florey's Field is a beautiful 3-acre secure dog walking paddock in Northmoor, Oxfordshire, available for exclusive hire. Fenced with 1.8 metre high fences for total peace of mind, the field features natural enrichment including logs, tyres, jumps, and a sandpit. A large field shelter provides seating, treats, an information board, and first aid kits with nearly full views of the field. Fresh water and man-made obstacles are also available. Ideal for puppies, reactive dogs, dogs with poor recall, or owners with limited mobility. Bookings are in 1-hour slots at £10 per hour for 1 dog."
    },
    {
      "id": "695f7c17fe74eb993b61fc69",
      "name": "Knightswood Welly Walk – Kingfisher's Rest",
      "newDescription": "Kingfisher's Rest is one of three stunning secure dog walks at Knightswood Equestrian Centre near Newquay, Cornwall. Spanning 4 to 10 acres, this walk features ancient woodland, wildflower meadows, and a swimming lake, all enclosed with 5ft 6in specialist dog fencing. The walk includes natural trees, water areas, covered woodland sections, and open meadow areas with wooden benches and picnic tables throughout. Each walk is well separated with tall screening between them. Reactive dog friendly. From £8 per hour with no limit on number of dogs."
    },
    {
      "id": "695f7c19fe74eb993b61fc78",
      "name": "Farthing Cottage",
      "newDescription": "Farthing Cottage is a modern, comfortable, and highly dog-friendly holiday cottage in the quiet village of Trunch, Norfolk, between the coast and the Norfolk Broads. The property features a properly secure garden and is set back from any roads. Located near Mundesley with miles of sandy beaches, and surrounded by fields and woods for walking. An exceptional level of doggy extras is provided, and several secure dog walking fields are available nearby for dogs that need to burn off energy before beach or woodland walks."
    },
    {
      "id": "695f8d05606a76753a99ddb4",
      "name": "Dog's Country Club Dog Fields (Field 4)",
      "newDescription": "Dog's Country Club is a premier dog facility nestled within 13 acres of secure fields and a sparkling lake in Lowton, Warrington. Featured on Channel 5, the club operates 5 outdoor fields, an outdoor sand paddock, and an indoor sand paddock. Fields range from 1.5 to 2.5 acres with fencing from 5ft to 7ft tall. The facility offers private secure field hire 7 days a week, along with dog training, puppy club, socialisation sessions, breed meetups, doggy daycare, dock diving, and agility. Fully licensed, insured, and dog behaviour accredited."
    },
    {
      "id": "695f8d05606a76753a99ddb5",
      "name": "Dog's Country Club Dog Fields (Field 2)",
      "newDescription": "Dog's Country Club Field 2 is a spacious 2.5-acre secure field with lake access, part of the 13-acre Dog's Country Club facility in Lowton, Warrington. The field features fencing from 5ft to 7ft tall with hedgerows and trees providing additional privacy. Available for private hire 7 days a week with shared parking and a maximum of 6 dogs per session. The wider facility includes 5 outdoor fields, sand paddocks, training areas, and a range of services including agility, dock diving, and socialisation sessions."
    },
    {
      "id": "695f8d0e606a76753a99ddfd",
      "name": "Let's Play Dog Walking Field",
      "newDescription": "Let's Play Dog Walking Field is a 2 to 4 acre secure paddock located in Llanellen, Abergavenny, NP7 9HT. The field is fenced with deer fencing and double plain wire stranding to 5ft along three sides, with one side featuring normal stock fencing with a 15ft dense mature hedge. Priced from £6 per 30 minutes with a maximum of 4 dogs allowed. Parking is available outside the field gate. A great space for stress-free off-lead fun and play with your dog."
    },
    {
      "id": "695f8d0f606a76753a99de00",
      "name": "The Dog Run, Dog Field",
      "newDescription": "The Dog Run is a one-acre secure dog field set in the beautiful North London village of Northaw, Potters Bar, conveniently situated ten minutes from the M25, A1, and A10. The 1.6-metre high fenced field features a separate enclosure full of equipment and activities for dogs to discover and play. A sheltered seating area is available for use in all weathers. Ideal for reactive, nervous, or older dogs, as well as those with recall issues. Sessions are 40 minutes including 30 minutes of exercise time. Private sessions from £7 for 1-4 dogs."
    },
    {
      "id": "695f8d11606a76753a99de0f",
      "name": "Preston Dog Field",
      "newDescription": "Preston Dog Field is a 2 to 4 acre secure paddock in Lea Town, near Preston, Lancashire. The field features 5ft to 5ft11 fencing and is reactive dog friendly, though it is surrounded by livestock. Shared parking is available outside the field, with a 10-minute buffer between customers. Booking is via Facebook where you meet the owner before and after your session, providing a personal and welcoming experience for you and your dogs."
    },
    {
      "id": "695f8d11606a76753a99de10",
      "name": "Padlock's Paddock Freedom Dog Field",
      "newDescription": "Padlock's Paddock is an 8-acre secure dog field in Send, Woking, Surrey, featuring three distinct areas: an agility area, a meadow, and woodland fields. Named after a beloved German Shepherd, the field offers sole-use hire with 4ft mixed fencing all round. The site includes secure car park with an enclosed walkway to the fields, a maximum of 4 dogs per session, and is priced at £15 for 50 minutes with a 10-minute buffer. The well-maintained grounds feature play equipment, natural enrichment, and a private, safe feel throughout."
    },
    {
      "id": "695f8d17606a76753a99de43",
      "name": "Pooch's Paddock Dog Field",
      "newDescription": "Pooch's Paddock is a 2-acre secure dog field with lovely views over the surrounding countryside in Belton, Isle of Axholme, between Doncaster and Scunthorpe. Surrounded by 1.2m high fencing, the field is available for private hire 7 days a week during daylight hours. Amenities include poo bags, a dog waste bin, water, seating, and shelter. Exclusive in-field parking is provided. Sessions start from £4 for 30 minutes (up to 2 dogs) and £8 for 1 hour."
    },
    {
      "id": "695fa7f2d3c46bff55a805d8",
      "name": "West Oxford Dog Secure Fields (The Paddock)",
      "newDescription": "The Paddock is a half-acre secure field at West Oxford Dog Fields in Yarnton, designed specifically for focused training, rehabilitation sessions, and short secure puppy walks. Part of a 35-acre site covering rolling Oxfordshire countryside, each field is fenced to 1.9m above ground with 0.2-0.3m submerged for added security. All fields feature secure airlock parking, dog wash facilities, shelter, and first aid. Bookings are separated by a 10-minute buffer so you never meet the next walker. Prices from £5.99 with a maximum of 7 dogs."
    },
    {
      "id": "695fa7f7d3c46bff55a805f8",
      "name": "Bark 'N' Go Dog Field",
      "newDescription": "Bark 'N' Go is a 2-acre secure dog exercise field in Glenrothes, Fife, enclosed with 8ft fencing all around for maximum security. The field offers private hire for exclusive use with your dogs, as well as friendly dog group sessions and social events organised throughout summer. Facilities include agility equipment, toys, treats, poo bags, shelter, seating areas, on-site toilet, and wheelchair access. Online booking available with prices from £7 for 30 minutes."
    },
    {
      "id": "695fa7fcd3c46bff55a80613",
      "name": "Chester's Dog Walking Field",
      "newDescription": "Chester's Dog Walking Field is a 2-acre secure field in New Longton, near Preston, Lancashire, enclosed with 6ft high fencing. The field features play and exercise equipment, a dog wash, poop bin, shelter, WC, coffee shop on site, and CCTV. Secure in-field parking is provided via a private yard with gravel parking area. Sessions available at £5 for 25 minutes or £10 for 55 minutes, with a maximum of 6 dogs. Highly rated at 4.7/5 from over 70 reviews."
    },
    {
      "id": "695fa7fcd3c46bff55a80614",
      "name": "Eva's Green Dog Walking Field",
      "newDescription": "Eva's Green is a secure dog walking field in Somerton, Somerset, with 2 fields available: Field A at 4 acres and Field B at just over 3 acres, both enclosed with 6ft deer fencing and galvanised wire along the bottom. Named after Eva, a Dutch Herder rescue dog, the field features tunnels, climbing equipment, picnic areas, rain shelters, and various play structures. Open 5am to 10pm daily, with bookings from £10 for 50 minutes (2 dogs). A 10-minute buffer between customers ensures privacy. Within easy reach of Shepton Mallet, Glastonbury, and Yeovil."
    },
    {
      "id": "695fa7fcd3c46bff55a80615",
      "name": "Out n Safe Dog Field",
      "newDescription": "Out n Safe Dog Field is a purpose-built 2 to 4 acre secure dog field at Portcullis Estate, Milton of Campsie, near Glasgow. Enclosed with 6ft (1.8m) fencing, the field welcomes dogs for private and group bookings. Facilities include toys, treats, poo bags, on-site parking outside the field entrance gate, and shelter areas. Priced from £7 for 30 minutes with a maximum of 14 dogs. Social events and friendly dog group sessions are organised throughout summer. All dogs must be kept on leads until inside the secure field."
    }
  ]
}