[
  {
    "fieldId": "695cfe651ee544eced64303e",
    "fieldName": "The Rambles Dog Walking Field",
    "currentDescription": "The Rambles, a 3ac secure fenced meadow, just north of Bath in the beautiful St Catherines Valley",
    "newDescription": "Grampound Dog Walking Field is a 1.5 acre grass field with approximately 5ft fencing (see notes), 10 minutes from St Austell and 15 minutes from Truro in Cornwall. Booking and Accessing Grampound Dog Field Booking Grampound Dog walking field is straight forward – the website is easy to use and offers sessions throughout the week of 30 or 60 minutes. On our visit access was a little tricky due to the number of cars parked on the roadside of the dead-end road you have to drive up to access the",
    "matchedName": "Grampound Secure Dog Walking Field",
    "sourceUrl": "https://britishdogfields.com/item/grampound-secure-dog-walking-field/",
    "strategy": "search_q2",
    "hasAboutText": true,
    "detailsCount": 11
  },
  {
    "fieldId": "695f7c0ffe74eb993b61fc37",
    "fieldName": "My Dog Run Secure Dog Field",
    "currentDescription": "Soulbury Road, Stewkley, LU7 0HW",
    "newDescription": "**Listing Coming Soon** All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Google Terms Report a map error Plan My Route Here are some other dog fields in the area: Willow Tree K9 Field, Biggleswade  Langford Road, Langford, Biggleswade, SG18 9RA L.W Canine & Behaviour, Ickwel  Caldecote Rd Biggleswade SG18 9EH Barky Park, Dog Field, Sandy  Deepdale, Potton, Sandy, SG19 2NH My Dog Run Secure Dog Field, Woodside  150-154 Woodside Road, Slip End, Luton Four Paws Adventure Academy for Dogs, Bedford  Water End, Cople, Bedford, MK44 3TY K9 Korner, Kempston  K9 Korner, Ahmad’s Farm, Tithe Road, Kempston MK43 8TH 5 Star Dog Paddock, Sandy  5 Hatley Road, Wrestlingworth, Sandy, SG19 2EH Thrift End Farm Canine & Pet Centre Enclosed Paddock, Bedford  Thrift End Farm, Silsoe Road Flitton, Wardhedges, Bedford, MK45 5EE Horton Corner Dog Walking Fields, Leighton Buzzard  Horton Road, Slapton, LU7 9SZ It's Not The Dog, Secure Dog Field, Upper Shelton  The Old Stables, Upper Shelton, MK43 0LT My Dog Run Secure Dog Field, Kempston  Green End Rd Kempston Bedford MK43 8RJ REVIEW: My Dog Run Secure Dog Field – Ridgmont  Mill Road, Husbourne Crawley, nr Ridgmont, MK43 0XF Willow Tree K9 Field, Biggleswade  Langford Road, Langford, Biggleswade, SG18 9RA L.W Canine & Behaviour, Ickwel  Caldecote Rd Biggleswade SG18 9EH Barky Park, Dog Field, Sandy  Deepdale, Potton, Sandy, SG19 2NH My Dog Run Secure Dog Field, Woodside  150-154 Woodside Road, Slip End, Luton Four Paws Adventure Academy for Dogs, Bedford  Water End, Cople, Bedford, MK44 3TY K9 Korner, Kempston  K9 Korner, Ahmad’s Farm, Tithe Road, Kempston MK43 8TH 5 Star Dog Paddock, Sandy  5 Hatley Road, Wrestlingworth, Sandy, SG19 2EH Thrift End Farm Canine & Pet Centre Enclosed Paddock, Bedford  Thrift End Farm, Silsoe Road Flitton, Wardhedges, Bedford, MK45 5EE Horton Corner Dog Walking Fields, Leighton Buzzard  Horton Road, Slapton, LU7 9SZ It's Not The Dog, Secure Dog Field, Upper Shelton  The Old Stables, Upper Shelton, MK43 0LT My Dog Run Secure Dog Field, Kempston  Green End Rd Kempston Bedford MK43 8RJ REVIEW: My Dog Run Secure Dog Field – Ridgmont  Mill Road, Husbourne Crawley, nr Ridgmont, MK43 0XF FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "My Dog Run Secure Dog Field Eaton Bray",
    "sourceUrl": "https://britishdogfields.com/item/my-dog-run-secure-dog-field-eaton-bray/",
    "strategy": "search_q1",
    "hasAboutText": true,
    "detailsCount": 1
  },
  {
    "fieldId": "695f7c10fe74eb993b61fc3a",
    "fieldName": "Twister’s Barn, Dog Arena",
    "currentDescription": "Grove Farm, Ettington",
    "newDescription": "Twister’s Barn is a 5400sqft indoor arena at Ettington Dog Walking Meadows. It has a woodchip base and is perfect for winter training or to escape the heat in the summer. Sessions are 45minutes with a 15 minute crossover and parking is in a secure parking area (5’6″ fencing) with no visibility to the surrounding yard. There’s lots of great agility equipment to try and everything is organised to the same excellent standards provided at Ettington’s secure fields. To visit Ettington’s fields: Puppy’s Corner Pudding Furlong Horse Meadow Official British Dog Fields Partner: All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Terms Report a map error Plan My Route Here are some other dog fields in the area: REVIEW: Lobbington Dog Field Lighthorne Heath  Lobbington Farm, CV35 0AR REVIEW: XPC Enclosed Dog Walking Field  CV37 0LP Leamington Dog Field, Leamington Spa  Harbury Lane, Leamington Spa, CV33 9QB REVIEW: Puppy's Corner Secure Dog Field, Ettington  Grove Farm, Ettington Paws & Play Secure Dog Field, Tanworth-in-Arden  Danzey Green Lane, Solihull, Warwickshire, B94 5BG Glebe Farm 'No Need For A Lead'  Birchley Heath Road, Nuneaton, CV10 0QY Greengate Dog Field, Dunchurch  Main Street, Thurlaston, CV23 9JS Glebe Farm  Moreton Morrell Stratford Dog Walking Field, Stratford upon Avon  Featherbed Lane, Stratford upon Avon, CV37 0ER REVIEW: Pudding Furlong Dog Field, Ettington  Grove Farm, Ettington Liberty Dog Fields, Connie's Corner  B80 7EE REVIEW: River Meadow Dog Walking  12, Clifford Chambers, Stratford-upon-Avon, CV378HR REVIEW: Lobbington Dog Field Lighthorne Heath  Lobbington Farm, CV35 0AR REVIEW: XPC Enclosed Dog Walking Field  CV37 0LP Leamington Dog Field, Leamington Spa  Harbury Lane, Leamington Spa, CV33 9QB REVIEW: Puppy's Corner Secure Dog Field, Ettington  Grove Farm, Ettington Paws & Play Secure Dog Field, Tanworth-in-Arden  Danzey Green Lane, Solihull, Warwickshire, B94 5BG Glebe Farm 'No Need For A Lead'  Birchley Heath Road, Nuneaton, CV10 0QY Greengate Dog Field, Dunchurch  Main Street, Thurlaston, CV23 9JS Glebe Farm  Moreton Morrell Stratford Dog Walking Field, Stratford upon Avon  Featherbed Lane, Stratford upon Avon, CV37 0ER REVIEW: Pudding Furlong Dog Field, Ettington  Grove Farm, Ettington Liberty Dog Fields, Connie's Corner  B80 7EE REVIEW: River Meadow Dog Walking  12, Clifford Chambers, Stratford-upon-Avon, CV378HR FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "Twister’s Barn, Dog Arena, Ettington",
    "sourceUrl": "https://britishdogfields.com/item/twisters-barn/",
    "strategy": "direct_url_2",
    "hasAboutText": true,
    "detailsCount": 13
  },
  {
    "fieldId": "695f7c16fe74eb993b61fc63",
    "fieldName": "Phoebe’s Place",
    "currentDescription": "Dog walking field at Phoebe’s Place. Visit for a safe, enclosed space for your dogs.",
    "newDescription": "‘Phoebe’s Place’ is a super dog field located approximately 7 miles from both Stevenage and Hitchin in Hertfordshire. It is 3.5 acres and offers countryside views in a farm setting and is surrounded by very well installed 5ft fencing. Booking and Accessing ‘Phoebe’s Place’ Booking is through a secure website and sessions are 50 minutes. Pricing varies for the number of dogs you chose to bring and there is a weekday and weekend price. Access is a little confusing if using the postcode so to easily locate the entrance, use the What3Words link on this page. Once you’re at the gate you travel down the farm track for 500m. It’s worth noting that if you have a car with limited ground clearance, you may want to take it easy as this track is a little rough but not impassable. Once you reach the end of the track there is a little sign directing you to the parking area directly outside the field gate. What is ‘Phoebe’s Place’ Like? Phoebe’s Place is a really nice field and suitable for all but the most athletic dogs with really nicely installed 5ft fencing. The photos I took really don’t do it justice because it was absolutely tipping it down! The field feels bigger than it’s 3.5 acre size and has nice thick grass. It is almost entirely surrounded by hedges and trees with a few additional locked gates for machinery access – One field was arable and the other looks to be a hay field – no livestock present at the time of my visit. The entrance was a little muddy (November) which is to be expected but as it doesn’t have in field parking, this isn’t as bad as many fields at this time of year. There are a few agricultural obstacles scattered around the field for interest – one of whch you may want to limit access to – piled crates with the slats presenting a hazard for any dogs climbing on them (see image). There is a picnic bench, dog waste disposal bins and water provided in a small bowser. Is ‘Phoebe’s Place’ Secure? This field is classified as ‘enclosed’ however the 5ft fencing is more than adequate for many dogs with a smaller aperture at the bottom of the net preventing small dogs and puppies squeezing through the fence. The fence has been really well installed and the entire fence is visible – the gate is 6ft+ weldmesh and is flush with the ground – no gaps for smaller escape artists. Things you should know about ‘Phoebe’s Place’ Phoebe’s Place is in a rural location and is very peaceful The field undulates and feels bigger than it’s 3.5 acre size Accessing the location itself requires driving down a few narrow roads but there are plenty of passing places Notes for Reactive Dog Owners: The location is within a farm, set back a field’s distance from the road, is surrounded by mature vegetation, and with few potential distractions There are no public rights of way passing in the imediatel area of the field One thing to note is that the parking is not enclosed so dogs must remain on the lead until in side the field Photos © British Dog Fields All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Terms Report a map error Plan My Route Here are some other dog fields in the area: Grow Walkies Dog Field, Flamstead  Old Watling Street, St Albans, AL3 8HS Grow Walkies Dog Field, Hertford  Waterhall Farm, Lower Hatfield Road, Hertford, SG13 8LE Canine Karma Dog Park, St Albans  Smug Oak Lane, Colney Street, St Albans, AL2 3PN Country Boarding Dog Park, Baldock  Country Boarding for Cats and Dogs Gannock Lane, Slip End, nr Baldock Hertfordshire SG7 6NL REVIEW: Grow Walkies, Dog Field, South Mimms  Earls Farm, Earls Lane, South Mimms, Potters Bar, EN6 3LT Grow Walkies Dog Field, Graveley  High Street, SG4 7LE Woof N Wag Dog Field, Letchworth  Stotfold Road, Stotfold, Letchworth Garden City, SG6 4JS The Dogology Dog Field, Hertford  Bayford Lane, Hartford Ross and Friends Dog Parks – Dog Safari, Berkhamstead  Cock Grove, Berkhamsted, HP4 3TZ Little Woodend Dog Paddock, Markyate  Little Woodend, Markyate Muddy Paws Dog Field, Bruntingford  Bury Field, Worsted Lane, Hare Street, Buntingford, SG9 0EF Paddock for Paws, Bovingdon  The Brambles, Flaunden Lane, Bovingdon, HP3 0PA Grow Walkies Dog Field, Flamstead  Old Watling Street, St Albans, AL3 8HS Grow Walkies Dog Field, Hertford  Waterhall Farm, Lower Hatfield Road, Hertford, SG13 8LE Canine Karma Dog Park, St Albans  Smug Oak Lane, Colney Street, St Albans, AL2 3PN Country Boarding Dog Park, Baldock  Country Boarding for Cats and Dogs Gannock Lane, Slip End, nr Baldock Hertfordshire SG7 6NL REVIEW: Grow Walkies, Dog Field, South Mimms  Earls Farm, Earls Lane, South Mimms, Potters Bar, EN6 3LT Grow Walkies Dog Field, Graveley  High Street, SG4 7LE Woof N Wag Dog Field, Letchworth  Stotfold Road, Stotfold, Letchworth Garden City, SG6 4JS The Dogology Dog Field, Hertford  Bayford Lane, Hartford Ross and Friends Dog Parks – Dog Safari, Berkhamstead  Cock Grove, Berkhamsted, HP4 3TZ Little Woodend Dog Paddock, Markyate  Little Woodend, Markyate Muddy Paws Dog Field, Bruntingford  Bury Field, Worsted Lane, Hare Street, Buntingford, SG9 0EF Paddock for Paws, Bovingdon  The Brambles, Flaunden Lane, Bovingdon, HP3 0PA FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "REVIEW: Phoebe’s Place, Weston",
    "sourceUrl": "https://britishdogfields.com/item/phoebes-place/",
    "strategy": "direct_url_1",
    "hasAboutText": true,
    "detailsCount": 13
  },
  {
    "fieldId": "695f7c16fe74eb993b61fc66",
    "fieldName": "Gilbert’s Gallop",
    "currentDescription": "Shepshed, Loughborough, LE12 9YD",
    "newDescription": "Gilbert’s Gallop is series of enclosed paddocks set over 1.5 acres situated approximately 11 miles north west of central Leicester. It’s very easy to access from the M1 so great for anyone on the move looking for a stop off. Updated: 10/02/23 Booking and Accessing Gilbert’s Gallop Booking is through a secure website – there are various options to add additional households, early-riser discounts and package offers. You access the field from the main farm track which is signposted from the road and turn left as you enter the yard. Here there is parking outside the field (location specified in the terms and conditions) and also space for one car inside an enclosed pen. Just be aware that because the gate opens inwards, you need to drive fully in to ensure you can close the gate behind you. Double check the space if you have a long wheel based vehicle. There is a combination lock on the first gate and the option to lock yourself into the fields on the secondary pedestrian gate which I would recommend using. What is Gilbert’s Gallop Like? Gilbert’s Gallop is a series of interlinked paddocks on the edge of a farm complex with one large play area, an area dedicated to good quality agility equipment and a separate area that has a mound overlooking the pony fields. You have access to all three areas for your booking and can restrict access to the mounded area should you wish. The fencing is 5ft stock fencing with the addition of a top line so may be unsuitable for small dogs so I recommend a perimeter walk in this field (as with all fields) prior to letting your dogs run free. There is plenty of enrichment (see photos) with hay bales and jumps in the main area as well as plenty of dog waste bins and fresh water available from containers. There was plenty to keep the dogs interested without having to reach for a ball! The agility area is comprehensive and if your dog is not experienced I would suggest that you avoid this as some of the equipment is quite big. The mound offers lovely views and the position of the field is gorgeous – surrounded by trees and hedges. One feature we were concerned about was the addition of two large, low trampolines with exposed metal springs. The existence of these is highlighted in the terms and conditions however, having not experienced this type of thing before and being excited, both of our dogs jumped on and slid across the surface catching their feet in the springs. I would have preferred these items not to have been a free-access item so that I could have controlled their access to them. Is Gilbert’s Gallop Secure? The fencing at Gilbert’s Gallop is 5ft with a top line. It’s made up of two lengths of stock fencing in many places and is not under tension. Whilst this is suitable for many dogs, this is not considered secure by our definition (see home page for definitions). Things you should know about Gilbert’s Gallop This field is excellent for dogs who have some experience with agility as there’s a lot to get stuck into The location is super for locals but also for anyone travelling on the M1 as a stop off Notes for Reactive Dog Owners: This field has some things that owners of reactive dogs and escape artists should be aware of: The field is surrounded by pony paddocks with shared fence boundaries – with the ponies were placid, our dogs did react to them as they were very close to the fence The field is on a working farm with traffic passing on a track and on the main road outside – this is obscured by hedges but in autumn when the hedges have died back a little, there was noise and movement Check the fencing carefully if you have escape artisits All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Google Terms Report a map error Plan My Route Here are some other dog fields in the area: Paws 2 Pasture, Belton  Mill Lane, Belton, LE12 9UJ The Oak Leaf Dog Park, Peckleton  Archers Lane, Peckleton, LE9 7RL Dadlington Dog Paddock, Hinkley  Poplars Farm, Sutton Lane, Dadlington, CV13 6JA Paws Adventure Park, Wigston Parva  Watling Street, Hinckley, LE10 3AR Long Clawson Dog Walking Field, Melton Mowbray  Hickling Lane, Long Clawson, Melton Mowbray, LE14 4PJ Secure Dog Run, Griffydam  Rempstone Road, LE67 8HP Grendon Dog Field, Atherstone  Dukes Meadows Farm, CV9 3DP Dogtastic Secure Dog Field, Newark  Dogtastic Daycare, Broom Leys Farm, 59 Broom Leys Road, Coalville, LE6 K9 Country Club, Gaddesby  Ashby Road, Gaddesby, LE7 4WF Buttercups Dog Paddock, Billesdon  Buttercups Tea Room, Rushfield Farm, Tilton Road, Billesdon, LE7 9FE The Dog Walking Field, Leicester/Ratby Paw Patrol Dog Walking Fields, Earl Shilton  Greenfields Thurlaston Lane, Earl Shilton, Leicester, LE9 7EF Paws 2 Pasture, Belton  Mill Lane, Belton, LE12 9UJ The Oak Leaf Dog Park, Peckleton  Archers Lane, Peckleton, LE9 7RL Dadlington Dog Paddock, Hinkley  Poplars Farm, Sutton Lane, Dadlington, CV13 6JA Paws Adventure Park, Wigston Parva  Watling Street, Hinckley, LE10 3AR Long Clawson Dog Walking Field, Melton Mowbray  Hickling Lane, Long Clawson, Melton Mowbray, LE14 4PJ Secure Dog Run, Griffydam  Rempstone Road, LE67 8HP Grendon Dog Field, Atherstone  Dukes Meadows Farm, CV9 3DP Dogtastic Secure Dog Field, Newark  Dogtastic Daycare, Broom Leys Farm, 59 Broom Leys Road, Coalville, LE6 K9 Country Club, Gaddesby  Ashby Road, Gaddesby, LE7 4WF Buttercups Dog Paddock, Billesdon  Buttercups Tea Room, Rushfield Farm, Tilton Road, Billesdon, LE7 9FE The Dog Walking Field, Leicester/Ratby Paw Patrol Dog Walking Fields, Earl Shilton  Greenfields Thurlaston Lane, Earl Shilton, Leicester, LE9 7EF FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search 1 review for “REVIEW: Gilbert’s Gallop, Shepshed” Ian Webb  November 23, 2023 Time at the site was excellent access was easy and well explained. The dog had a great time, I will certainly book some more visits. My only concern is the electronic booking system I have tried today to book more Slots but have not managed too due to the system this is very frustrating. But otherwise great. Thanks Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "REVIEW: Gilbert’s Gallop, Shepshed",
    "sourceUrl": "https://britishdogfields.com/item/gilberts-gallop/",
    "strategy": "direct_url_1",
    "hasAboutText": true,
    "detailsCount": 11
  },
  {
    "fieldId": "695f7c18fe74eb993b61fc75",
    "fieldName": "Merlin’s Meadow",
    "currentDescription": "Lode Lane, Bushley, GL20 6HP",
    "newDescription": "Merlin’s Meadow Tewksbury is a secure dog walking field just a mile outside Tewksbury itself and only 3 miles from the M5 Junction 9. It is very conveniently located for both locals and anyone travelling too or from the South West and Wales. This dog park is over 16 acres and is one of a few in the UK of this size secured to 6ft. Booking and Accessing Merlin’s Meadow To book Merlin’s Meadow in Tewksbury you have to contact the owner directly by text or via Facebook messenger. Because of the p",
    "matchedName": "Merlins Meadow Tewksbury",
    "sourceUrl": "https://britishdogfields.com/item/merlins-meadow-tewksbury/",
    "strategy": "search_q2",
    "hasAboutText": true,
    "detailsCount": 8
  },
  {
    "fieldId": "695f7c19fe74eb993b61fc78",
    "fieldName": "Farthing Cottage",
    "currentDescription": "Chapel Road, Trunch NR28 0QG",
    "newDescription": "All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Terms Report a map error Plan My Route Here are some other dog fields in the area: Zoomies4Paws, Warminster  Green Sands Stables Bradley Rd Warminster BA12 7JY REVIEW: Hendred Hounds Secure Dog Field, Wantage  East Hendred, Wantage, OX12 8JL Happy Hound Secure Dog Field, Adisham  196 The St, Adisham, Canterbury, CT3 3LD K9 Fun Time, Dog Field, Kirklevington  Forest Lane, Kirklevington, Yarm, North Yorkshire, TS15 9PY Bow Wow Adventure Playground for Dogs, Bury St Edmunds  Skippers Farm, Cocks Green Lane, Bury St Edmunds, IP30 0UE Parkfield Dog Park, Pontefract  Parkfield Lane, Featherstone, WF7 6FB Monty's Meadow, Stratton-on-the-Fosse  Church Farm Stratton-on-the-Fosse Radstock BA3 4QU Runaway Dog Park and Agility, Wakefield  Wickentree Bungalow, Middlestown, United Kingdom, WF4 4TZ Paw Paddock – Secure Dog Field, Romsey  Old Salisbury Lane, Romsey, Hampshire, SO51 0HB Manor Farm Dog Meadow, Oxwick  Manor Farm, Oxwick, Fakenham, NR217HZ Calvin's Fields at the Coloured Ponds, Nr Petersfield – Calvin's Field  Rogate Road, Rake, GU31 5DL Long Clawson Dog Walking Field, Melton Mowbray  Hickling Lane, Long Clawson, Melton Mowbray, LE14 4PJ Zoomies4Paws, Warminster  Green Sands Stables Bradley Rd Warminster BA12 7JY REVIEW: Hendred Hounds Secure Dog Field, Wantage  East Hendred, Wantage, OX12 8JL Happy Hound Secure Dog Field, Adisham  196 The St, Adisham, Canterbury, CT3 3LD K9 Fun Time, Dog Field, Kirklevington  Forest Lane, Kirklevington, Yarm, North Yorkshire, TS15 9PY Bow Wow Adventure Playground for Dogs, Bury St Edmunds  Skippers Farm, Cocks Green Lane, Bury St Edmunds, IP30 0UE Parkfield Dog Park, Pontefract  Parkfield Lane, Featherstone, WF7 6FB Monty's Meadow, Stratton-on-the-Fosse  Church Farm Stratton-on-the-Fosse Radstock BA3 4QU Runaway Dog Park and Agility, Wakefield  Wickentree Bungalow, Middlestown, United Kingdom, WF4 4TZ Paw Paddock – Secure Dog Field, Romsey  Old Salisbury Lane, Romsey, Hampshire, SO51 0HB Manor Farm Dog Meadow, Oxwick  Manor Farm, Oxwick, Fakenham, NR217HZ Calvin's Fields at the Coloured Ponds, Nr Petersfield – Calvin's Field  Rogate Road, Rake, GU31 5DL Long Clawson Dog Walking Field, Melton Mowbray  Hickling Lane, Long Clawson, Melton Mowbray, LE14 4PJ FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "Farthing Cottage, Trunch",
    "sourceUrl": "https://britishdogfields.com/item/farthing-cottage/",
    "strategy": "direct_url_1",
    "hasAboutText": true,
    "detailsCount": 0
  },
  {
    "fieldId": "695f7c19fe74eb993b61fc7a",
    "fieldName": "Puppy’s Corner Secure Dog Field",
    "currentDescription": "2ND PLACE: BRITISH DOG FIELD OF THE YEAR\n\nGrove Farm, Ettington",
    "newDescription": "Ettington is the gold standard of secure dog walking fields and it’s evident when you arrive that this is a facility run by people who truly understand the requirements of a secure field. Grove Farm is easy to find, located just south of Stratford-upon-Avon, Warwickshire. It has three excellent fields, all different and an indoor training bran. Links to the other facilities can be found at the bottom of the page. Booking and Accessing Puppy’s Corner Secure Dog Field To access Puppy’s Corner you follow the farm track from the main road, passed the farm complex (follow the signs) and up to the entrance gate – it’s approximately half a mile and you can’t miss it. As with all fields at Ettington, you will meet the owner Charlie for your first visit – even if you have visited another of their fields previously, each field is unique and this meet and greet is really useful to get an idea of the layout of these enormous fields. Secure online booking is simple – for ‘Puppy’s’ there is the choice of 45 minute or 60 minute sessions. What Is Puppy’s Corner Like? Puppy’s Corner is the newest of the secure dog fields at Ettington and offers 33 acres of flat pasture, woodland and a swimming pond. This field is the most suitable of the Ettington fields for those with mobility challenges but still able to walk a farm field. As with the other facilities at Ettington, Puppy’s corner is drive-in, with a large grassy area for dogs to go to the toilet, before entering the main facility. This fully enclosed car park also houses the large water bowser for washing post-pond and fresh drinking water in a separate container. There are some lovely natural and agricultural obstacles and perches throughout the paddocks and the woodland is at the far end of the 33 acre plot. The pond is fenced and deep enough for a swim with shallow sides for those a little more wary. Washing is sometimes required after a dip as the clay can get a bit sticky on drying! The views from Puppy’s Corner stretch for miles and this is a really restful location for those looking for a good old run around in the fresh air. Is Puppy’s Corner at Ettington Secure Dog Fields Secure? The fencing is 180cm and well maintained with daily checks which is very reassuring. Things You Should Know about Puppy’s Corner The field is HUGE but flat so easy to get around The field is separated with stock fencing to partition your walk and ensure you can keep track of your dog The gate code is change daily for your security Notes for Reactive Dog Owners: Ettington operates a 15 minute changeover buffer which means you should not cross previous or following users. In our experience, this works extremely well and we have never crossed paths with other users in many visits. Puppy’s Corner has a farm track that runs partially alongside one short length of the field – those with very reactive dogs may prefer to use Horse Meadow or Pudding Furlong for this reason. Other Facilities at Ettington Horse Meadow Pudding Furlong Twister’s Barn Instagram Facebook Media © British Dog Fields Official British Dog Fields Partner: All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Plan My Route Here are some other dog fields in the area: Swallowfield Dog Walking Fields, Lapworth  Swallowfield Equestrian Ltd, Rising Lane, Lapworth, Solihull B94 6JD Leamington Dog Field, Leamington Spa  Harbury Lane, Leamington Spa, CV33 9QB REVIEW: Bluebell Dog Field, Southam  Almshouses, Leamington Hastings, Rugby, CV23 8DY REVIEW: Pudding Furlong Dog Field, Ettington  Grove Farm, Ettington Meriden Dog Training and Exercise Paddock  Kinwalsey Lane, Coventry, CV7 7HT Melody's Meadows  Stretton Lane, Wolston, Coventry, Cv83FR REVIEW: Horse Meadow Dog Field, Ettington  Grove Farm, Ettington REVIEW: XPC Enclosed Dog Walking Field  CV37 0LP Highfields Hounds Secure Dog Walking Fields, Southam  Welsh Road East, Southam, Leamington Spa, CV47 1NF Glebe Farm 'No Need For A Lead'  Birchley Heath Road, Nuneaton, CV10 0QY REVIEW: Harbury Fields Dog Walking Fields, Leamington Spa  Harbury Fields Farm, Middle Road, Harbury, Leamington Spa, CV33 9JN Paws & Play Secure Dog Field, Tanworth-in-Arden  Danzey Green Lane, Solihull, Warwickshire, B94 5BG Swallowfield Dog Walking Fields, Lapworth  Swallowfield Equestrian Ltd, Rising Lane, Lapworth, Solihull B94 6JD Leamington Dog Field, Leamington Spa  Harbury Lane, Leamington Spa, CV33 9QB REVIEW: Bluebell Dog Field, Southam  Almshouses, Leamington Hastings, Rugby, CV23 8DY REVIEW: Pudding Furlong Dog Field, Ettington  Grove Farm, Ettington Meriden Dog Training and Exercise Paddock  Kinwalsey Lane, Coventry, CV7 7HT Melody's Meadows  Stretton Lane, Wolston, Coventry, Cv83FR REVIEW: Horse Meadow Dog Field, Ettington  Grove Farm, Ettington REVIEW: XPC Enclosed Dog Walking Field  CV37 0LP Highfields Hounds Secure Dog Walking Fields, Southam  Welsh Road East, Southam, Leamington Spa, CV47 1NF Glebe Farm 'No Need For A Lead'  Birchley Heath Road, Nuneaton, CV10 0QY REVIEW: Harbury Fields Dog Walking Fields, Leamington Spa  Harbury Fields Farm, Middle Road, Harbury, Leamington Spa, CV33 9JN Paws & Play Secure Dog Field, Tanworth-in-Arden  Danzey Green Lane, Solihull, Warwickshire, B94 5BG FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search 2 reviews for “REVIEW: Puppy’s Corner Secure Dog Field, Ettington” W Beaton  May 13, 2022 Marvellous !!! Maureen  August 19, 2024 Amazing field with lots to do, great views & total freedom for our dogs to run & play. Over 30 acres of pure joy & our dogs absolutely love it. The owner is very knowledgeable about reactive dogs & ensures there is no cross over between customers which is so refreshing Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "Puppys Corner Ettington",
    "sourceUrl": "https://britishdogfields.com/item/puppys-corner-ettington/",
    "strategy": "search_q3",
    "hasAboutText": true,
    "detailsCount": 14
  },
  {
    "fieldId": "695f8d01606a76753a99dd98",
    "fieldName": "Kingates Grange’s Dog Walking Field",
    "currentDescription": "Kingates Grange, Newport Road, Ventnor, PO38 2NS",
    "newDescription": "All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Google Terms Report a map error Plan My Route Here are some other dog fields in the area: Paw Paddock Secure Dog Field, Mapledurwell  Down Ln, Basingstoke RG25 2LH Private Dog Paddock, Netley  Grange Rd., Southampton SO31 8GD Romsey Paws Park, Dog Field, Wigley  Shelley Oaks Farm, Shelley Lane, Ower, Romsey, SO51 6AS Paw Paddock – Secure Dog Field, Fareham  Stroud Green Ln, Fareham, PO14 2HT Paw Paddock Secure Dog Field, Liss  Farnham Road, GU33 6LA Wild & Free Dog Meadows, Fordingbridge – Buttercup Agility Meadow  Mill Dam, Bickton, Fordingbridge Zoomie Dog Fields, Upper Clatford  Balksbury Hill, Upper Clatford, Andover, SP11 7LW Calvin's Fields at the Coloured Ponds, Nr Petersfield – Calvin's Field  Rogate Road, Rake, GU31 5DL Merry Tree Paddock, Dog Field, Fordingbridge  High Sreet, Woodgreen, Fordingbridge, SP6 2AU Doggy Retreat Dog Field, Hambrook  Hambrook Hill South, Hambrook Tapster's Paddock, Goodwood  Tapster's Paddock, Goodwood Barker's Paddock, Whitchurch  Barkers Paddock Southfield Farm, Micheldever Rd, Whitchurch, Hampshire, RG28 7JL Paw Paddock Secure Dog Field, Mapledurwell  Down Ln, Basingstoke RG25 2LH Private Dog Paddock, Netley  Grange Rd., Southampton SO31 8GD Romsey Paws Park, Dog Field, Wigley  Shelley Oaks Farm, Shelley Lane, Ower, Romsey, SO51 6AS Paw Paddock – Secure Dog Field, Fareham  Stroud Green Ln, Fareham, PO14 2HT Paw Paddock Secure Dog Field, Liss  Farnham Road, GU33 6LA Wild & Free Dog Meadows, Fordingbridge – Buttercup Agility Meadow  Mill Dam, Bickton, Fordingbridge Zoomie Dog Fields, Upper Clatford  Balksbury Hill, Upper Clatford, Andover, SP11 7LW Calvin's Fields at the Coloured Ponds, Nr Petersfield – Calvin's Field  Rogate Road, Rake, GU31 5DL Merry Tree Paddock, Dog Field, Fordingbridge  High Sreet, Woodgreen, Fordingbridge, SP6 2AU Doggy Retreat Dog Field, Hambrook  Hambrook Hill South, Hambrook Tapster's Paddock, Goodwood  Tapster's Paddock, Goodwood Barker's Paddock, Whitchurch  Barkers Paddock Southfield Farm, Micheldever Rd, Whitchurch, Hampshire, RG28 7JL FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "Kingates Grange’s Dog Walking Field, Ventnor",
    "sourceUrl": "https://britishdogfields.com/item/kingates-granges-dog-walking-field/",
    "strategy": "direct_url_1",
    "hasAboutText": true,
    "detailsCount": 7
  },
  {
    "fieldId": "695f8d05606a76753a99ddb4",
    "fieldName": "Dog’s Country Club Dog Fields (Field 4)",
    "currentDescription": "Dogs Country Club 191 Slag Lane Lowton Warrington WA3 1BU",
    "newDescription": "All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Terms Report a map error Plan My Route Here are some other dog fields in the area: Sotherton Dog Meadow, Halesworth  Mayfield, Low Farm, Sotherton, Halesworth, IP19 8NP Woodland Walkies, Mildenhall  Thicketts Road, Mildenhall, Wiltshire, SN8 2FJ Kenny Hill Dog Adventure Park, Kenny Hill  Kenny Hill Farm, Ken",
    "matchedName": "The Dog Walking Field Leiston",
    "sourceUrl": "https://britishdogfields.com/item/the-dog-walking-field-leiston/",
    "strategy": "search_q3",
    "hasAboutText": true,
    "detailsCount": 7
  },
  {
    "fieldId": "695f8d05606a76753a99ddb5",
    "fieldName": "Dog’s Country Club Dog Fields (Field 2)",
    "currentDescription": "191 Slag Lane, Lowton, Warrington, WA3 1BU",
    "newDescription": "All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Terms Report a map error Plan My Route Here are some other dog fields in the area: Sotherton Dog Meadow, Halesworth  Mayfield, Low Farm, Sotherton, Halesworth, IP19 8NP Woodland Walkies, Mildenhall  Thicketts Road, Mildenhall, Wiltshire, SN8 2FJ Kenny Hill Dog Adventure Park, Kenny Hill  Kenny Hill Farm, Ken",
    "matchedName": "The Dog Walking Field Leiston",
    "sourceUrl": "https://britishdogfields.com/item/the-dog-walking-field-leiston/",
    "strategy": "search_q3",
    "hasAboutText": true,
    "detailsCount": 7
  },
  {
    "fieldId": "695f8d05606a76753a99ddb6",
    "fieldName": "Dog’s Country Club",
    "currentDescription": "191 Slag Lane, Lowton, Warrington, WA3 1BU",
    "newDescription": "Field Notes Dog Field 1 is secured with fences ranging from 5ft – 7ft tall as well as hedgerows and trees to provide privacy and low visibility. We also use a “double gated” system for extra security. It is positioned well inside the property, extremely quiet surrounding and well away from the main road. Field 1 is well maintained with grass cut at different levels, the walking paths for humans cut short and wide enough for pleasant and easy access. The tall grass sections are left for dogs to run through and to explore the wildness of this beautiful field. Field 1 has access to the lake and it has dog-friendly access with the water level at its deepest at 5ft. Field 1 & Field 2 share access to the lake, the lake is divided in the middle dogs are not able to swim across. All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Google Terms Report a map error Plan My Route Here are some other dog fields in the area: Cheshire View Dog Park, Kinnerton  Barracks Lane, Kinnerton, CH4 9BB Bowdon Dog Park, Bowdon  Bowdon Dog Park, Bailey Walk, Bowdon, WA143EP The Pawsome Park, Frodsham  Manley Rd Frodsham WA6 6HL Kingsley Dog Field, Kingsley  Blossom Hill Stables, Mill Lane, Kingsley, Frodsham, WA6 8JA Weaver Pet Care, Dog Field, Nantwich  Whitchurch, Nantwich, SY13 4HZ Pawsome Paddock, Chester  Whitby Ln Chester CH1 6PH Best Kept Secret, Dog Field, Chester  Manley Road, Alvanley, Frodsham, WA6 9DL My Dog Field, Cuddington  Norley Road, CW8 2TJ Dog's Country Club Dog Fields (Field 4), Warrington  Dogs Country Club 191 Slag Lane Lowton Warrington WA3 1BU Mobberley Dog Park, Knutsford  Green Bank Farm, Hobcroft lane, Mobberley , Knutsford, Cheshire, WA16 7QR The Dog Play Park, Biddulph Park  Pines Ln Biddulph Park Rd Stoke-on-Trent ST8 7SP The Dogs Paddocks, Dog Field, Lower Whitley  Marsh Lane, Lower Whitley, Warrington, WA44EY Cheshire View Dog Park, Kinnerton  Barracks Lane, Kinnerton, CH4 9BB Bowdon Dog Park, Bowdon  Bowdon Dog Park, Bailey Walk, Bowdon, WA143EP The Pawsome Park, Frodsham  Manley Rd Frodsham WA6 6HL Kingsley Dog Field, Kingsley  Blossom Hill Stables, Mill Lane, Kingsley, Frodsham, WA6 8JA Weaver Pet Care, Dog Field, Nantwich  Whitchurch, Nantwich, SY13 4HZ Pawsome Paddock, Chester  Whitby Ln Chester CH1 6PH Best Kept Secret, Dog Field, Chester  Manley Road, Alvanley, Frodsham, WA6 9DL My Dog Field, Cuddington  Norley Road, CW8 2TJ Dog's Country Club Dog Fields (Field 4), Warrington  Dogs Country Club 191 Slag Lane Lowton Warrington WA3 1BU Mobberley Dog Park, Knutsford  Green Bank Farm, Hobcroft lane, Mobberley , Knutsford, Cheshire, WA16 7QR The Dog Play Park, Biddulph Park  Pines Ln Biddulph Park Rd Stoke-on-Trent ST8 7SP The Dogs Paddocks, Dog Field, Lower Whitley  Marsh Lane, Lower Whitley, Warrington, WA44EY FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "Dog’s Country Club, Dog Field (Field 1) Warrington",
    "sourceUrl": "https://britishdogfields.com/item/dogs-country-club/",
    "strategy": "direct_url_1",
    "hasAboutText": true,
    "detailsCount": 10
  },
  {
    "fieldId": "695f8d06606a76753a99ddba",
    "fieldName": "Martha’s Meadow, Dog Field",
    "currentDescription": "Martha's Meadow, Upton upon Severn, WR8 0AR",
    "newDescription": "To book Martha’s Meadow please call Dave on 07803 072840 Media © Martha’s Meadow Official British Dog Fields Partner: All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Terms Report a map error Plan My Route Here are some other dog fields in the area: Muttnall Green Secure Dog Field, Droitwich  Addis Lane, Cutnall Green, Droitwich, WR90NE Run Free Dogs, Bromsgrove  Woodcote Lane, Bromsgrove, B61 9af Tower View Dog Park, Evesham  Longdon Hill, Wickhamford, WR11 7RP Canine Capers Dog Walking Field, Wyre Forest  Brickyard Cottage Stourport-on-Severn, Bewdley, DY13 8DZ Bromsgrove Dog Field – The Fenced Meadow, Bromsgrove  Fairfield, Worcestershire Bromsgrove Dog Fields – Half Past Field, Bromsgrove  Fairfield, Worcestershire Prestwood Doggy Play Park, Stourbridge  Wolverhampton Road, DY7 5DG Merrywell Dog Paddock, Offenham  Evesham Rd, Offenham, WR118SA Off the Leash Dog Field, Bransford  Stockend Farm, Station Road, Bransford, Powick, WR6 5JH Evesham Dog Walking Field, Evesham  Evesham, WR11 4TR Oak Ridge Total Dog Care Dog Field, Tenbury Wells  Maythorn Villa, Newnham Bridge, Tenbury Wells, WR15 8JA The Pawticularly Secure Exercise Dog Field, Worcester  Old Quarry Drive, Main Road, Hallow, Worcester, WR2 6LS Muttnall Green Secure Dog Field, Droitwich  Addis Lane, Cutnall Green, Droitwich, WR90NE Run Free Dogs, Bromsgrove  Woodcote Lane, Bromsgrove, B61 9af Tower View Dog Park, Evesham  Longdon Hill, Wickhamford, WR11 7RP Canine Capers Dog Walking Field, Wyre Forest  Brickyard Cottage Stourport-on-Severn, Bewdley, DY13 8DZ Bromsgrove Dog Field – The Fenced Meadow, Bromsgrove  Fairfield, Worcestershire Bromsgrove Dog Fields – Half Past Field, Bromsgrove  Fairfield, Worcestershire Prestwood Doggy Play Park, Stourbridge  Wolverhampton Road, DY7 5DG Merrywell Dog Paddock, Offenham  Evesham Rd, Offenham, WR118SA Off the Leash Dog Field, Bransford  Stockend Farm, Station Road, Bransford, Powick, WR6 5JH Evesham Dog Walking Field, Evesham  Evesham, WR11 4TR Oak Ridge Total Dog Care Dog Field, Tenbury Wells  Maythorn Villa, Newnham Bridge, Tenbury Wells, WR15 8JA The Pawticularly Secure Exercise Dog Field, Worcester  Old Quarry Drive, Main Road, Hallow, Worcester, WR2 6LS FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "Marthas Meadow Hanley Swan",
    "sourceUrl": "https://britishdogfields.com/item/marthas-meadow-hanley-swan/",
    "strategy": "search_q3",
    "hasAboutText": true,
    "detailsCount": 12
  },
  {
    "fieldId": "695f8d08606a76753a99ddcd",
    "fieldName": "The Wheelhouse Veterinary Centre, Dog Field",
    "currentDescription": "The Wheelhouse Venerinary Centre, Chalfont St Giles",
    "newDescription": "Field Notes At the back of our surgery in Chalfont St Giles, we are fortunate enough to have a large paddock. When not in use by our Dog Training School and Agility classes, we can hire this space out to the public who may have dogs that need to be exercised off the lead in a restrained environment with no other dogs being walked at the same time. The paddock is surrounded by a mixture of fencing: Wall, wooden panel and chain link. The surround is approximately 5 foot high except for the gate entrance, which is lower. All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Terms Report a map error Plan My Route Here are some other dog fields in the area: Chalfont Dog Park, Chalfont St Peter  West Hyde Lane Chalfont St Peter, SL9 0QP Houndabout MK, Little Horwood  Winslow Road, Little Horwood, MK17 0PD Unleashed Fields, Dog Field, Harpenden  Unleashed Fields Harpenden Cooters End Lane Harpenden LU1 3TU REVIEW: Poundon Pastures, Dog Field, Bicester  Poundon, Bicester, OX27 9BB Down at The Farm Secure Dog Field, Grendon Underwood  Dunmead Farm, Marsh Gibbon Rd, Aylesbury, HP18 0TA Thornborough Paws, Thornborough  Nash Road, Thornborough, MK18 2DY Dog Walking Field MK, Castlethorpe  Fox Covert Lane, Castlethorpe, MK19 7EY REVIEW: Greenlands Oak Farm Dog Field, Buckingham  Water Stratford, Buckingham, MK18 5DP Paddock for Paws, Kings Langley  The Brambles, Flaunden Lane, Bovingdon, HP3 0PA REVIEW: My Dog Run Secure Dog Field, Stewkley  Soulbury Road, Stewkley, LU7 0HW REVIEW: Bucks Dog Walking Field, Buckingham  Buzzard Holt, Main Street, Chackmore, Buckingham, MK18 5JE Paws on the Run, Dog Field, Stoke Poges  Bells Hill, Stoke Poges, SL2 4EJ Chalfont Dog Park, Chalfont St Peter  West Hyde Lane Chalfont St Peter, SL9 0QP Houndabout MK, Little Horwood  Winslow Road, Little Horwood, MK17 0PD Unleashed Fields, Dog Field, Harpenden  Unleashed Fields Harpenden Cooters End Lane Harpenden LU1 3TU REVIEW: Poundon Pastures, Dog Field, Bicester  Poundon, Bicester, OX27 9BB Down at The Farm Secure Dog Field, Grendon Underwood  Dunmead Farm, Marsh Gibbon Rd, Aylesbury, HP18 0TA Thornborough Paws, Thornborough  Nash Road, Thornborough, MK18 2DY Dog Walking Field MK, Castlethorpe  Fox Covert Lane, Castlethorpe, MK19 7EY REVIEW: Greenlands Oak Farm Dog Field, Buckingham  Water Stratford, Buckingham, MK18 5DP Paddock for Paws, Kings Langley  The Brambles, Flaunden Lane, Bovingdon, HP3 0PA REVIEW: My Dog Run Secure Dog Field, Stewkley  Soulbury Road, Stewkley, LU7 0HW REVIEW: Bucks Dog Walking Field, Buckingham  Buzzard Holt, Main Street, Chackmore, Buckingham, MK18 5JE Paws on the Run, Dog Field, Stoke Poges  Bells Hill, Stoke Poges, SL2 4EJ FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "The Wheelhouse Veterinary Centre, Dog Field, Chalfont St Giles",
    "sourceUrl": "https://britishdogfields.com/item/the-wheelhouse-veterinary-centre/",
    "strategy": "direct_url_2",
    "hasAboutText": true,
    "detailsCount": 9
  },
  {
    "fieldId": "695f8d08606a76753a99ddce",
    "fieldName": "Priestlands Dogs Secure Field",
    "currentDescription": "Penn Street, Amersham, Buckinghamshire",
    "newDescription": "Field Notes Our park-like picturesque 2.5 acre field is fenced with 1.4 metre livestock fencing, making the area a lovely dog-safe space for you (and your dog/s) to enjoy. If it is your first time visiting the field, we recommend walking around the field with your dog on the lead, so you can best decide whether our field is suitable for your dogs needs.  All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Terms Report a map error Plan My Route Here are some other dog fields in the area: REVIEW: Poundon Pastures, Dog Field, Bicester  Poundon, Bicester, OX27 9BB REVIEW: Grounds Farm Dog Field, Buckingham  Grounds Farm, Buckingham, MK18 5DP Doggy Playground, Hemel Hempstead  Little Heath Lane, Bourne End, Hemel Hempstead, HP1 2RU My Dog Run Secure Dog Field, Ashley Green  83 – 97 Chesham Road, Ashley Green, Chesham The Potterings, Dog Field, Stoke Mandeville  Stoke Mandeville, HP22 5YB Grow Walkies, Dog Field, Stoke Mandeville  Risborough Road, Stoke Mandeville, HP22 5XL REVIEW: Castlethorpe Secure Dog Walking Field, Milton Keynes  Wolverton Road, Castlethorpe, MK19 7ES Terrific Bark Park, Dog Field, Stoke Poges  Brockhurst Wood, Slough, SL2 4AF Dog Walking Field MK, Castlethorpe  Fox Covert Lane, Castlethorpe, MK19 7EY Wild at Heart Dog Play Park, Bovingdon  White Hart Cottage, Chesham Road, Bovingdon, HP3 0NP MK Dog Field, Milton Keynes  Alston Drive, Bradwell Abbey, MK13 9AP The Wheelhouse Veterinary Centre, Dog Field, Chalfont St Giles  The Wheelhouse Venerinary Centre, Chalfont St Giles REVIEW: Poundon Pastures, Dog Field, Bicester  Poundon, Bicester, OX27 9BB REVIEW: Grounds Farm Dog Field, Buckingham  Grounds Farm, Buckingham, MK18 5DP Doggy Playground, Hemel Hempstead  Little Heath Lane, Bourne End, Hemel Hempstead, HP1 2RU My Dog Run Secure Dog Field, Ashley Green  83 – 97 Chesham Road, Ashley Green, Chesham The Potterings, Dog Field, Stoke Mandeville  Stoke Mandeville, HP22 5YB Grow Walkies, Dog Field, Stoke Mandeville  Risborough Road, Stoke Mandeville, HP22 5XL REVIEW: Castlethorpe Secure Dog Walking Field, Milton Keynes  Wolverton Road, Castlethorpe, MK19 7ES Terrific Bark Park, Dog Field, Stoke Poges  Brockhurst Wood, Slough, SL2 4AF Dog Walking Field MK, Castlethorpe  Fox Covert Lane, Castlethorpe, MK19 7EY Wild at Heart Dog Play Park, Bovingdon  White Hart Cottage, Chesham Road, Bovingdon, HP3 0NP MK Dog Field, Milton Keynes  Alston Drive, Bradwell Abbey, MK13 9AP The Wheelhouse Veterinary Centre, Dog Field, Chalfont St Giles  The Wheelhouse Venerinary Centre, Chalfont St Giles FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "Priestlands Dogs Secure Field, Amersham",
    "sourceUrl": "https://britishdogfields.com/item/priestlands-dogs-secure-field/",
    "strategy": "direct_url_1",
    "hasAboutText": true,
    "detailsCount": 13
  },
  {
    "fieldId": "695f8d0d606a76753a99ddf7",
    "fieldName": "Platt’s Puppy Paddock",
    "currentDescription": "Platt’s Farm, Aber Road, Llanfairfechan, Conwy, LL33 0HL",
    "newDescription": "All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Terms Report a map error Plan My Route Here are some other dog fields in the area: Gwalia Dog Fields, Near Overton on Dee  Gwalia Farm, Overton, LL13 0LG Paw Park Secure Dog Field, Rhuddlan  Abergele Road, Rhuddlan, LL18 5UE Un-Leashed Dog Field, Whitford  Downing Road, Whitford, CH8 9EG Maes Barcio, Clawddnewydd  B5105, Clawddnewydd, Denbighshire, LL15 2NN Zoomies Zone, Dog Field, Anglesey  Sir Ynys Mon, Llanfairpwllgwyngyll, LL61 5YR Aberconwy Indoor Arena, Conwy  Garth Road, Llandudno Junction, LL31 9JF Ryecroft Meadow Dog Fields, Wrexham  Caia Farm, Old Wrexham Road, Wrexham, LL12 8UA K9 Walled Garden, St Asaph  The Roe, St Asaph, LL17 0HU Ty Gwyn Pets Field Hire, Padeswood  Ty Gwyn Pets, Chester Road, Padeswood, Flintshire, CH7 4JF Little Pydew Play Paddock, Prestatyn  Little Pydew, Prestatyn LL19 8BE The Dog Paddock, Dog Field, St Asaph  Bron Elwy, Upper Denbigh Road, St Asaph, LL17 0BH The Dog Patch, Dog Field, Mold  Ysceifiog Road, Mold, CH88QL Gwalia Dog Fields, Near Overton on Dee  Gwalia Farm, Overton, LL13 0LG Paw Park Secure Dog Field, Rhuddlan  Abergele Road, Rhuddlan, LL18 5UE Un-Leashed Dog Field, Whitford  Downing Road, Whitford, CH8 9EG Maes Barcio, Clawddnewydd  B5105, Clawddnewydd, Denbighshire, LL15 2NN Zoomies Zone, Dog Field, Anglesey  Sir Ynys Mon, Llanfairpwllgwyngyll, LL61 5YR Aberconwy Indoor Arena, Conwy  Garth Road, Llandudno Junction, LL31 9JF Ryecroft Meadow Dog Fields, Wrexham  Caia Farm, Old Wrexham Road, Wrexham, LL12 8UA K9 Walled Garden, St Asaph  The Roe, St Asaph, LL17 0HU Ty Gwyn Pets Field Hire, Padeswood  Ty Gwyn Pets, Chester Road, Padeswood, Flintshire, CH7 4JF Little Pydew Play Paddock, Prestatyn  Little Pydew, Prestatyn LL19 8BE The Dog Paddock, Dog Field, St Asaph  Bron Elwy, Upper Denbigh Road, St Asaph, LL17 0BH The Dog Patch, Dog Field, Mold  Ysceifiog Road, Mold, CH88QL FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "Platt’s Puppy Paddock, Llanfairfechan",
    "sourceUrl": "https://britishdogfields.com/item/platts-puppy-paddock/",
    "strategy": "direct_url_1",
    "hasAboutText": true,
    "detailsCount": 13
  },
  {
    "fieldId": "695f8d0e606a76753a99ddfd",
    "fieldName": "Let’s Play Dog Walking Field",
    "currentDescription": "Llanellen, Abergavenny, NP7 9HT",
    "newDescription": "All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Terms Report a map error Plan My Route Here are some other dog fields in the area: Bonnie Dugs Unleashed, Bellshill  Bonnie Dugs Unleashed, Motherwell Runfree Bargeddie, Jumbo Field  Cuilhill Rd, Baillieston, Bargeddie, G69 6UF FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "Lets Walk Private Secure Dog Field Cleland",
    "sourceUrl": "https://britishdogfields.com/item/lets-walk-private-secure-dog-field-cleland/",
    "strategy": "search_q3",
    "hasAboutText": true,
    "detailsCount": 8
  },
  {
    "fieldId": "695f8d0e606a76753a99ddff",
    "fieldName": "Freya’s Meadow, Dog Field",
    "currentDescription": "ESSEX DOG FIELD OF THE YEAR 2024\n\nLatton Street, Harlow, Essex, CM20 3SD",
    "newDescription": "All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Terms Report a map error Plan My Route Here are some other dog fields in the area: Colchester Dog Field, Ardleigh  Springvalley Lane, Ardleigh, Colchester, CO7 7SA Wickford Dog Field, Wickford  Doublegate Lane, Wickford, SS11 8ud Bouncers Dog Park, Harlow  Manston Road, Harlow, CM20 3PA Crazy Dogs Forest Adventure, Dog Field, Takeley  Takeley, CM22 7TF The Bark Park Woodlands Adventure, Rettendon  Runwell Hall Farm, Hoe Lane, Rettendon, CM3 8DQ Purleigh Exercise Field, Purleigh  Carriage House, Purleigh Slamsey's Dog Field, Braintree  Slamseys Farm, Blackley Lane, Great Notley, Braintree, CM77 7QW Billericay Dog Training Centre, Billericay  The Green Barn, Wash Road, Basildon, SS15 4BP Grow Walkies, Dog Field, Colchester  Wick Farm Wick Lane Ardleigh (Nr Colchester) Essex CO7 7RE Dogs Play Centre (Dog Field), Colchester  Seven Saints Farm, Severalls Lane, Colchester, CO4 5JB The Dog Walking Field, Chelmsford  The Dog Walking Field – Chelmsford Margaretting Rd Writtle Chelmsford CM1 3PN Turf Paws Dog Field, Ashingdon  Ethelbert road, Ashingdon, SS4 3JR Colchester Dog Field, Ardleigh  Springvalley Lane, Ardleigh, Colchester, CO7 7SA Wickford Dog Field, Wickford  Doublegate Lane, Wickford, SS11 8ud Bouncers Dog Park, Harlow  Manston Road, Harlow, CM20 3PA Crazy Dogs Forest Adventure, Dog Field, Takeley  Takeley, CM22 7TF The Bark Park Woodlands Adventure, Rettendon  Runwell Hall Farm, Hoe Lane, Rettendon, CM3 8DQ Purleigh Exercise Field, Purleigh  Carriage House, Purleigh Slamsey's Dog Field, Braintree  Slamseys Farm, Blackley Lane, Great Notley, Braintree, CM77 7QW Billericay Dog Training Centre, Billericay  The Green Barn, Wash Road, Basildon, SS15 4BP Grow Walkies, Dog Field, Colchester  Wick Farm Wick Lane Ardleigh (Nr Colchester) Essex CO7 7RE Dogs Play Centre (Dog Field), Colchester  Seven Saints Farm, Severalls Lane, Colchester, CO4 5JB The Dog Walking Field, Chelmsford  The Dog Walking Field – Chelmsford Margaretting Rd Writtle Chelmsford CM1 3PN Turf Paws Dog Field, Ashingdon  Ethelbert road, Ashingdon, SS4 3JR FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "Freya’s Meadow, Dog Field, Harlow",
    "sourceUrl": "https://britishdogfields.com/item/freyas-meadow/",
    "strategy": "direct_url_2",
    "hasAboutText": true,
    "detailsCount": 11
  },
  {
    "fieldId": "695f8d0f606a76753a99de00",
    "fieldName": "The Dog Run, Dog Field",
    "currentDescription": "Northaw Road, West Potters Bar, EN6 4QX",
    "newDescription": "All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Terms Report a map error Plan My Route Here are some other dog fields in the area: Barky Park, Dog Field, Sandy  Deepdale, Potton, Sandy, SG19 2NH 5 Star Dog Paddock, Sandy  5 Hatley Road, Wrestlingworth, Sandy, SG19 2EH My Dog Run Secure Dog Field, Woodside  150-154 Woodside Road, Slip End, Luton REVIEW: My Dog Run Secure Dog Field – Ridgmont  Mill Road, Husbourne Crawley, nr Ridgmont, MK43 0XF My Dog Run Secure Dog Field, Eaton Bray  B489 Eaton Bray Dunstable LU6 2LA It's Not The Dog, Secure Dog Field, Upper Shelton  The Old Stables, Upper Shelton, MK43 0LT Willow Tree K9 Field, Biggleswade  Langford Road, Langford, Biggleswade, SG18 9RA K9 Korner, Kempston  K9 Korner, Ahmad’s Farm, Tithe Road, Kempston MK43 8TH Horton Corner Dog Walking Fields, Leighton Buzzard  Horton Road, Slapton, LU7 9SZ TEMPORARILY CLOSED: Flimby Dog Paddock, Workington  Hung Gill, Flimby, CA15 8RU L.W Canine & Behaviour, Ickwel  Caldecote Rd Biggleswade SG18 9EH Thrift End Farm Canine & Pet Centre Enclosed Paddock, Bedford  Thrift End Farm, Silsoe Road Flitton, Wardhedges, Bedford, MK45 5EE Barky Park, Dog Field, Sandy  Deepdale, Potton, Sandy, SG19 2NH 5 Star Dog Paddock, Sandy  5 Hatley Road, Wrestlingworth, Sandy, SG19 2EH My Dog Run Secure Dog Field, Woodside  150-154 Woodside Road, Slip End, Luton REVIEW: My Dog Run Secure Dog Field – Ridgmont  Mill Road, Husbourne Crawley, nr Ridgmont, MK43 0XF My Dog Run Secure Dog Field, Eaton Bray  B489 Eaton Bray Dunstable LU6 2LA It's Not The Dog, Secure Dog Field, Upper Shelton  The Old Stables, Upper Shelton, MK43 0LT Willow Tree K9 Field, Biggleswade  Langford Road, Langford, Biggleswade, SG18 9RA K9 Korner, Kempston  K9 Korner, Ahmad’s Farm, Tithe Road, Kempston MK43 8TH Horton Corner Dog Walking Fields, Leighton Buzzard  Horton Road, Slapton, LU7 9SZ TEMPORARILY CLOSED: Flimby Dog Paddock, Workington  Hung Gill, Flimby, CA15 8RU L.W Canine & Behaviour, Ickwel  Caldecote Rd Biggleswade SG18 9EH Thrift End Farm Canine & Pet Centre Enclosed Paddock, Bedford  Thrift End Farm, Silsoe Road Flitton, Wardhedges, Bedford, MK45 5EE FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "My Dog Run Secure Dog Field Kempston",
    "sourceUrl": "https://britishdogfields.com/item/my-dog-run-secure-dog-field-kempston/",
    "strategy": "search_q1",
    "hasAboutText": true,
    "detailsCount": 1
  },
  {
    "fieldId": "695f8d11606a76753a99de0f",
    "fieldName": "Preston Dog Field",
    "currentDescription": "Darkinson lane, Preston, United Kingdom, Lea Town",
    "newDescription": "Media © Chester’s Dog Walking Field All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Terms Report a map error Plan My Route Here are some other dog fields in the area: Midge Hall Secure Dog Field, Leyland  Midge Hall Lane, Leyland, PR26 6TN Willow Wood Dog Field, Forton  Winder Lane, Forton, Preston, PR3 0 Mawdesley Pooch Park Secure Dog Field Ormskirk  Cliffs Farm, Wood Lane, Mawdesley, Ormskirk, L40 2RL My Dog Barn, Indoor Dog Field, Ormskirk  Low Meadows Farm, Wanes Blades Road, Lathom, L40 4BN Skipadoos Secure Dog Field, Bolton  Horrocks Moor Farm, Scout Rd, Bolton, BL1 7NZ The Dogs Frolics Dog Field, Halsall  The Green Barn, Asmall Lane, Halsall, Ormskirk, L39 8RB Lytham Dog Fields (5 Fields), Moss Side  Moss Side Farm, Moss Side, Lytham Road, FY8 4NB Society for Abandoned Animals Dog Field, Stretford  Barfoot Bridge, Stretford, Manchester, M32 9UP Westhoughton Dog Park (3 Fields), Westhoughton  Jacks Lane, Westhoughton, BL5 2DD The Bark Park Secure Fields, Whalley  Ridding Lane, Whalley, Clitheroe, BB7 9TW WaggyTailsWigan Dog Field, Wigan  Walkers Lower Farm, Scot lane, Aspull, Wigan, WN21YL Bold Bark Secure Dog Runs, Blackburn  Redshell Lane, Belthorn, Blackburn, BB1 2PH Midge Hall Secure Dog Field, Leyland  Midge Hall Lane, Leyland, PR26 6TN Willow Wood Dog Field, Forton  Winder Lane, Forton, Preston, PR3 0 Mawdesley Pooch Park Secure Dog Field Ormskirk  Cliffs Farm, Wood Lane, Mawdesley, Ormskirk, L40 2RL My Dog Barn, Indoor Dog Field, Ormskirk  Low Meadows Farm, Wanes Blades Road, Lathom, L40 4BN Skipadoos Secure Dog Field, Bolton  Horrocks Moor Farm, Scout Rd, Bolton, BL1 7NZ The Dogs Frolics Dog Field, Halsall  The Green Barn, Asmall Lane, Halsall, Ormskirk, L39 8RB Lytham Dog Fields (5 Fields), Moss Side  Moss Side Farm, Moss Side, Lytham Road, FY8 4NB Society for Abandoned Animals Dog Field, Stretford  Barfoot Bridge, Stretford, Manchester, M32 9UP Westhoughton Dog Park (3 Fields), Westhoughton  Jacks Lane, Westhoughton, BL5 2DD The Bark Park Secure Fields, Whalley  Ridding Lane, Whalley, Clitheroe, BB7 9TW WaggyTailsWigan Dog Field, Wigan  Walkers Lower Farm, Scot lane, Aspull, Wigan, WN21YL Bold Bark Secure Dog Runs, Blackburn  Redshell Lane, Belthorn, Blackburn, BB1 2PH FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "Chesters Dog Walking Field",
    "sourceUrl": "https://britishdogfields.com/item/chesters-dog-walking-field/",
    "strategy": "search_q1",
    "hasAboutText": true,
    "detailsCount": 11
  },
  {
    "fieldId": "695f8d11606a76753a99de10",
    "fieldName": "Padlock’s Paddock Freedom Dog Field",
    "currentDescription": "Potters Lane, Send, Woking, GU23 7JT",
    "newDescription": "Last Review Date: May 2023 Beulah View Secure Dog Fields is a 3.5 acre field with a beautiful view over rolling hills located 4 miles from Leeds City Centre. This field is fenced to 1.8m all around and has secure parking for 2 cars. The gates are also 1.8m. Booking and Accessing Beulah View Secure Dog Field Booking is through a secure website and sessions are 45 minutes long allowing for a strict 15 minute gap between users. Access is very straight forward – the W3W link and Google maps pin will both take you directly to the gate – it’s situated off Hall Lane and the track to the field is suitable for heavier vehicles too. You pull off the road onto the track and drive up to the first gate. This gate is padlocked. Once you drive in, you secure this gate and use the pedestrian access gate to reach the main field. What is Beulah View Secure Dog Field Like? Beulah View dog field is unusual in that it is a beautiful field that overlooks a major city! The views stretch for miles over West Yorkshire and it really is a lovely spot. The grass is mown beautifully with meandering paths through longer grass providing plenty of sniffles. It’s a rolling hill so not a very challenging walk but something to be mindful of if you are less mobile. This field is new at the time of writing and there will be additions to the field through the summer months – this includes natural play features and enrichment. There are poo bins but no water so you need to remember to bring your own. Is Beulah View Dog Field Secure? This field is fenced to 1.8m and also has weld mesh gates., the netting is 5cm x 10cm so is suitable for most dogs (See image for fence netting). The car park is a secure pen for safe release and has a good gravel surface. Things you should know about Beulah View Secure Dog Field The view is really unusual for a dog field and the undulations mean that you never really even feel like you’re fenced in Beulah View has been created on permanent pasture so is wonderfully grassy! This field is very easily accessible and will be a real treat for people in the area looking for somewhere safe – you can even walk here with relative ease. All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Terms Report a map error Plan My Route Here are some other dog fields in the area: Cullingworth Pooches Playground  Ghyll Clough Meadow, Slaymaker Lane, Oakworth, BD22 7EU Dogs Unleashed, Birkenshaw  Soureby Cross Way, East Bierley, BD4 6PZ K9 Paw Park, Dog Field, Stamford Bridge  High Catton Grange, High Catton, Stamford Bridge YO41 1EP Woof and Tumble Secure Dog Fields, Horsforth  Otley Old Road, Horsforth, Leeds, LS18 5HZ Robroyd Doggie Play Park, Barnsley  Green Lane,Worsborough, Barnsley, S70 6FN Berties Dog Field, Market Weighton  Market Weighton, York, YO43 3JN Brighouse Dog Field, Brighouse  Mill Hill Lane, Brighouse, HD6 2EL Fido Fun Farm, Eastoft  The Stables, Washinghall Lane, Eastoft, DN17 4PY The Secret Garden Dog Park, Calverley  Carr Farm Barn, 74 Carr Road, Calverley, Leeds, LS28 5QR Sammy's Secure Dog Field, Richmond  Thorndale Trout Farm, Melsonby, DL10 5NJ Lions Den Dog Field, Walkington  Lions Den Farm, Walkington, Beverley, HU17 8SZ Hegiins Dog Paddocks, Southowram Halifax  Glenwood House Church Lane, Southowram, Halifax, HX3 9TD Cullingworth Pooches Playground  Ghyll Clough Meadow, Slaymaker Lane, Oakworth, BD22 7EU Dogs Unleashed, Birkenshaw  Soureby Cross Way, East Bierley, BD4 6PZ K9 Paw Park, Dog Field, Stamford Bridge  High Catton Grange, High Catton, Stamford Bridge YO41 1EP Woof and Tumble Secure Dog Fields, Horsforth  Otley Old Road, Horsforth, Leeds, LS18 5HZ Robroyd Doggie Play Park, Barnsley  Green Lane,Worsborough, Barnsley, S70 6FN Berties Dog Field, Market Weighton  Market Weighton, York, YO43 3JN Brighouse Dog Field, Brighouse  Mill Hill Lane, Brighouse, HD6 2EL Fido Fun Farm, Eastoft  The Stables, Washinghall Lane, Eastoft, DN17 4PY The Secret Garden Dog Park, Calverley  Carr Farm Barn, 74 Carr Road, Calverley, Leeds, LS28 5QR Sammy's Secure Dog Field, Richmond  Thorndale Trout Farm, Melsonby, DL10 5NJ Lions Den Dog Field, Walkington  Lions Den Farm, Walkington, Beverley, HU17 8SZ Hegiins Dog Paddocks, Southowram Halifax  Glenwood House Church Lane, Southowram, Halifax, HX3 9TD FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search 2 reviews for “REVIEW: Beulah View Secure Dog Field, Leeds” Patricia Gilfeather  July 15, 2023 Had our first visit today 15/07/3023 , we took some of our whippets and boy they enjoyed the space . All secure and felt comfortable letting them run crazy , the views are a bonus , beautiful location . Will be back soon Anji Rouse  October 23, 2023 Visited several times with our cross breed rescue dog who is very reactive to other dogs. Love the 15 minute change over period. The field itself is great very secure and stunning views. We are very lucky that this is pretty much on our doorstep. Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "Beulah View Secure Dog Field Leeds",
    "sourceUrl": "https://britishdogfields.com/item/beulah-view-secure-dog-field-leeds/",
    "strategy": "search_q3",
    "hasAboutText": true,
    "detailsCount": 12
  },
  {
    "fieldId": "695f8d14606a76753a99de27",
    "fieldName": "Ayrshire’s K9 Play Park (Dog Field)",
    "currentDescription": "Monkton, South Ayrshire, KA9 2SQ",
    "newDescription": "Media © Ayrshire’s K9 Play Park All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Terms Report a map error Plan My Route Here are some other dog fields in the area: The Field Inverness Secure Dog Field, Inverness  A82, Inverness, IV3 8JN Run Free Dog Fields – Wee Field, Kingswells  Smiddybrae Works, Kingswells, Kingsford, AB15 8SL Wag and Run, Mauchline Run Free Dog Fields – Flemington Field, Cambuslang  Loanend Cottages, Cambuslang, G72 8YD The Paw Park Dog Field, Broxburn  A89, Broxburn, EH52 5BH The Scurry Dog Fields [The Flush], Auchterhouse  Auchterhouse Country Sports, Auchterhouse, Dundee, Tayside, DD3 0QN Mairi Animal Services Secure Dog Field, Linlithgow  Mairi’s Animal Services, Dun-Mor Auldhill Road, Bridgend, Linlithgow, EH49 6NH Callender K9  Field 3, Mollands Road, Callander, FK17 8JJ Archie's Dog Acres, Forth  Beeches Farm, Forth, ML11 8HA WaggTail Woods (Tanya's Trail) Secure Dog Field, North Kessock  Craigbreck Farm, North Kessock, IV1 3XG Westhill Secure Dog Park, Aberdeen – North Field  Westhill, Aberdeen, AB15 8SS Let The Dogs Run, Auchterarder  Station Corner, Tullibardine Perthshire Auchterarder PH3 1NJ The Field Inverness Secure Dog Field, Inverness  A82, Inverness, IV3 8JN Run Free Dog Fields – Wee Field, Kingswells  Smiddybrae Works, Kingswells, Kingsford, AB15 8SL Wag and Run, Mauchline Run Free Dog Fields – Flemington Field, Cambuslang  Loanend Cottages, Cambuslang, G72 8YD The Paw Park Dog Field, Broxburn  A89, Broxburn, EH52 5BH The Scurry Dog Fields [The Flush], Auchterhouse  Auchterhouse Country Sports, Auchterhouse, Dundee, Tayside, DD3 0QN Mairi Animal Services Secure Dog Field, Linlithgow  Mairi’s Animal Services, Dun-Mor Auldhill Road, Bridgend, Linlithgow, EH49 6NH Callender K9  Field 3, Mollands Road, Callander, FK17 8JJ Archie's Dog Acres, Forth  Beeches Farm, Forth, ML11 8HA WaggTail Woods (Tanya's Trail) Secure Dog Field, North Kessock  Craigbreck Farm, North Kessock, IV1 3XG Westhill Secure Dog Park, Aberdeen – North Field  Westhill, Aberdeen, AB15 8SS Let The Dogs Run, Auchterarder  Station Corner, Tullibardine Perthshire Auchterarder PH3 1NJ FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "Ayrshire’s K9 Play Park (Dog Field), Prestwick",
    "sourceUrl": "https://britishdogfields.com/item/ayrshires-k9-play-park/",
    "strategy": "direct_url_1",
    "hasAboutText": true,
    "detailsCount": 10
  },
  {
    "fieldId": "695f8d17606a76753a99de3e",
    "fieldName": "Wagswood Dog Park",
    "currentDescription": "Baran Rd, Pontardawe, Swansea",
    "newDescription": "Media © Wagswood Dog Park  All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Terms Report a map error Plan My Route Here are some other dog fields in the area: Zoomies Zone, Dog Field, Anglesey  Sir Ynys Mon, Llanfairpwllgwyngyll, LL61 5YR Sweetwell Fields, Dog Field, Blackwood  Sweetwell Fields, Pontllanfraith, Blackwood, NP12 2BL Wern Isaf Dog Walking Fi",
    "matchedName": "Wagswood Dog Park, Swansea",
    "sourceUrl": "https://britishdogfields.com/item/wagswood-dog-park/",
    "strategy": "direct_url_1",
    "hasAboutText": true,
    "detailsCount": 10
  },
  {
    "fieldId": "695f8d17606a76753a99de43",
    "fieldName": "Pooch’s Paddock Dog Field",
    "currentDescription": "King Edward Street, Belton, Isle of Axholme, DN9 1QN",
    "newDescription": "All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Google Terms Report a map error Plan My Route Here are some other dog fields in the area: Zero's Play Zone, Callington  Higher Frogwell Field, Frogwell Rd, Callington Rafferty's Field, Callington  Florence Road, Callington, PL17 8EA Paws n Hooves Dog Field, Callington  Sevenstones, Callington, Cornwall, PL17 8HZ Charwell Dog Adventures, Adventure Field, Callington  Charwell, Cadson Lane, Callington, PL17 7HW Hugus Hounds, Threemilestone  Hugus Farm, Besore, Threemilestone, TR3 6BL Mapowders Dog Exercise Field, Bude Coopers RSPCA Venton Centre, St Columb  Higher Quoit Animal Centre, TR9 6JS REVIEW: Beanos Ball Park, Dog Fields, Helston  Lower Dacum Farm, Porkellis, Helston, TR13 0PD Boscarne Dog Walking Field, Penzance  St Buryan, Penzance, Cornwall, TR19 6EL Pig and Pooch, Coombe  Dowgas, Coombe, Saint Austell Field of Dreams, Launceston  Langdon Cross, Launceston, PL15 8NL Bark Park, Dog Field, Hayle  68 Bosence Road, Townshend, Hayle, TR27 6AL Zero's Play Zone, Callington  Higher Frogwell Field, Frogwell Rd, Callington Rafferty's Field, Callington  Florence Road, Callington, PL17 8EA Paws n Hooves Dog Field, Callington  Sevenstones, Callington, Cornwall, PL17 8HZ Charwell Dog Adventures, Adventure Field, Callington  Charwell, Cadson Lane, Callington, PL17 7HW Hugus Hounds, Threemilestone  Hugus Farm, Besore, Threemilestone, TR3 6BL Mapowders Dog Exercise Field, Bude Coopers RSPCA Venton Centre, St Columb  Higher Quoit Animal Centre, TR9 6JS REVIEW: Beanos Ball Park, Dog Fields, Helston  Lower Dacum Farm, Porkellis, Helston, TR13 0PD Boscarne Dog Walking Field, Penzance  St Buryan, Penzance, Cornwall, TR19 6EL Pig and Pooch, Coombe  Dowgas, Coombe, Saint Austell Field of Dreams, Launceston  Langdon Cross, Launceston, PL15 8NL Bark Park, Dog Field, Hayle  68 Bosence Road, Townshend, Hayle, TR27 6AL FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "Padstow Pooch Paddock Padstow",
    "sourceUrl": "https://britishdogfields.com/item/padstow-pooch-paddock-padstow/",
    "strategy": "search_q3",
    "hasAboutText": true,
    "detailsCount": 6
  },
  {
    "fieldId": "695fa7f2d3c46bff55a805d8",
    "fieldName": "West Oxford Dog Secure Fields (The Paddock)",
    "currentDescription": "Spring Hill Road, Cassington Road, Yarnton, Kidlington, OX5 1QD",
    "newDescription": "Official British Dog Fields Partner: All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Terms Here are some other dog fields in the area: [REVIEW] Oxford Secure Dog Walking Field  Shellgrove Farm, Horton-cum-Studley, Brill Road, OX33 1DE REVIEW : Enslow Secure Dog Field, Kidlington  Enslow Farm, Kidlington, A4095 REVIEW: Shotteswell Dog Walking Fields, The Hilltop Field, Banbury  Bury Court Farm, Shotteswell, OX17 1JA Run Dog Run, Reading  Gallowstree Common, Reading, RG4 9HS REVIEW: Shotteswell Dog Walking Fields, The Paddock  Bury Court Farm, Shotteswell, OX17 1JA REVIEW: Middle Barton Dog Park  Church Lane, Middle Barton, Oxfordshire Secure Paws Dog Field, Chipping Norton  Hook Norton Rd Chipping Norton OX7 5TE West Oxford Dog Secure Fields (The Paddock)  Spring Hill Road, Cassington Road, Yarnton, Kidlington, OX5 1QD REVIEW: The Bark Park Bicester  Charbridge Ln, Launton, Bicester OX26 4SS Paws Paddock, Drayton Saint Leonard  OX10 7AR REVIEW: Oaklands Dog Field, Bloxham  Bloxham Road, Milcombe, Oxfordshire OX15 4HU REVIEW: Lose the Lead Dog Field, Arncott  Ploughley Road, Lower Arncott, OX25 1NY [REVIEW] Oxford Secure Dog Walking Field  Shellgrove Farm, Horton-cum-Studley, Brill Road, OX33 1DE REVIEW : Enslow Secure Dog Field, Kidlington  Enslow Farm, Kidlington, A4095 REVIEW: Shotteswell Dog Walking Fields, The Hilltop Field, Banbury  Bury Court Farm, Shotteswell, OX17 1JA Run Dog Run, Reading  Gallowstree Common, Reading, RG4 9HS REVIEW: Shotteswell Dog Walking Fields, The Paddock  Bury Court Farm, Shotteswell, OX17 1JA REVIEW: Middle Barton Dog Park  Church Lane, Middle Barton, Oxfordshire Secure Paws Dog Field, Chipping Norton  Hook Norton Rd Chipping Norton OX7 5TE West Oxford Dog Secure Fields (The Paddock)  Spring Hill Road, Cassington Road, Yarnton, Kidlington, OX5 1QD REVIEW: The Bark Park Bicester  Charbridge Ln, Launton, Bicester OX26 4SS Paws Paddock, Drayton Saint Leonard  OX10 7AR REVIEW: Oaklands Dog Field, Bloxham  Bloxham Road, Milcombe, Oxfordshire OX15 4HU REVIEW: Lose the Lead Dog Field, Arncott  Ploughley Road, Lower Arncott, OX25 1NY FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "West Oxford Dog Secure Fields The Meadow",
    "sourceUrl": "https://britishdogfields.com/item/west-oxford-dog-secure-fields-the-meadow/",
    "strategy": "search_q1",
    "hasAboutText": true,
    "detailsCount": 0
  },
  {
    "fieldId": "695fa7f4d3c46bff55a805e3",
    "fieldName": "Welham’s Farm Secure Dog Walking Field",
    "currentDescription": "Lords Bridge, Wiggenhall St Mary the Virgin, King's Lynn, PE34 3BP",
    "newDescription": "If you’re interested in finding out what Norfolk can be like as a holiday destination with a reactive dog, check out this blog. FOR REALLY ‘DOG FRIENDLY’ HOLIDAYS SEE BRITISH DOG FIELDS OFFICIAL PARTNER All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Terms Report a map error Plan My Route Here are some other dog fields in the area: Ely Dogs Activity Meadows , Ely  White Cross Farm, Wilburton, Ely, CB6 3QB Paula's Pawsome Dog Park, The Heywood  Heywood Rd, Diss,IP22 5TA Martham Paw Ground Dog Fields – The Spinney  Grange Farm, NR29 4RA Hethel Dog Fields, Wymondham  Potash Lane, Hethel, NR14 8EY All Dogs Meadow, Ringstead  Sedgeford Road, Ringstead Paws For Play, Dog Field, Wymondham  Deep Lane track, off Tuttles Lane, Wymondham, NR18 0JQ Shotesham Paw Park, Shotesham St Mary  Norwich Road, Shotesham St Mary, NR15 1UZ REVIEW: Walcott Dog Park, Walcott  Rookery Farm Road, Walcott, NR12 0PE Peddars Paws Field, Bridgham  The Paddocks Bridgham Norwich NR16 2SB Farthing Cottage, Trunch  Chapel Road, Trunch NR28 0QG Meggies Meadow Dog Field, Brandon Parva  Flood Lane, Norwich, NR9 4DJ Willow Farm Walkies, Dog Field, Great Moulton  Frith Way, Great Moulton, Norwich, NR152AT Ely Dogs Activity Meadows , Ely  White Cross Farm, Wilburton, Ely, CB6 3QB Paula's Pawsome Dog Park, The Heywood  Heywood Rd, Diss,IP22 5TA Martham Paw Ground Dog Fields – The Spinney  Grange Farm, NR29 4RA Hethel Dog Fields, Wymondham  Potash Lane, Hethel, NR14 8EY All Dogs Meadow, Ringstead  Sedgeford Road, Ringstead Paws For Play, Dog Field, Wymondham  Deep Lane track, off Tuttles Lane, Wymondham, NR18 0JQ Shotesham Paw Park, Shotesham St Mary  Norwich Road, Shotesham St Mary, NR15 1UZ REVIEW: Walcott Dog Park, Walcott  Rookery Farm Road, Walcott, NR12 0PE Peddars Paws Field, Bridgham  The Paddocks Bridgham Norwich NR16 2SB Farthing Cottage, Trunch  Chapel Road, Trunch NR28 0QG Meggies Meadow Dog Field, Brandon Parva  Flood Lane, Norwich, NR9 4DJ Willow Farm Walkies, Dog Field, Great Moulton  Frith Way, Great Moulton, Norwich, NR152AT FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "Welham’s Farm Secure Dog Walking Field, Kings Lynn",
    "sourceUrl": "https://britishdogfields.com/item/welhams-farm-secure-dog-walking-field/",
    "strategy": "direct_url_1",
    "hasAboutText": true,
    "detailsCount": 9
  },
  {
    "fieldId": "695fa7f4d3c46bff55a805e5",
    "fieldName": "Paula’s Pawsome Dog Park",
    "currentDescription": "Heywood Rd, Diss,IP22 5TA",
    "newDescription": "Photos © Paula’s Pawsome Dog Park If you’re interested in finding out what Norfolk can be like as a holiday destination with a reactive dog, check out this blog. FOR REALLY ‘DOG FRIENDLY’ HOLIDAYS SEE BRITISH DOG FIELDS OFFICIAL PARTNER All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Terms Report a map error Plan My Route Here are some other dog fields in the area: Eves Hill Dog Walking Field, Norwich  Eves Hill Farm Reepham Road, Booton, Norwich, NR10 4TD Martham Paw Ground Dog Fields – The Spinney  Grange Farm, NR29 4RA REVIEW: Walcott Dog Park, Walcott  Rookery Farm Road, Walcott, NR12 0PE Peddars Paws Field, Bridgham  The Paddocks Bridgham Norwich NR16 2SB Willow Farm Walkies, Dog Field, Great Moulton  Frith Way, Great Moulton, Norwich, NR152AT Brandon Dog Field, Brandon  Chalk Road, Brandon IP27 0SD Farthing Cottage, Trunch  Chapel Road, Trunch NR28 0QG Puppy Paddocks Dog Fields, Barford  Carleton End, Watton Road, Barford, Norwich, NR9 4AR Paws For Play, Dog Field, Wymondham  Deep Lane track, off Tuttles Lane, Wymondham, NR18 0JQ Redmoore Meadow Dog Field, Saham Toney  Saham Toney, Thetford, IP25 6RR Greenwood Barn, Ridlington  Mill Common Rd, North Walsham, NR28 9TX Manor Farm Dog Meadow, Oxwick  Manor Farm, Oxwick, Fakenham, NR217HZ Eves Hill Dog Walking Field, Norwich  Eves Hill Farm Reepham Road, Booton, Norwich, NR10 4TD Martham Paw Ground Dog Fields – The Spinney  Grange Farm, NR29 4RA REVIEW: Walcott Dog Park, Walcott  Rookery Farm Road, Walcott, NR12 0PE Peddars Paws Field, Bridgham  The Paddocks Bridgham Norwich NR16 2SB Willow Farm Walkies, Dog Field, Great Moulton  Frith Way, Great Moulton, Norwich, NR152AT Brandon Dog Field, Brandon  Chalk Road, Brandon IP27 0SD Farthing Cottage, Trunch  Chapel Road, Trunch NR28 0QG Puppy Paddocks Dog Fields, Barford  Carleton End, Watton Road, Barford, Norwich, NR9 4AR Paws For Play, Dog Field, Wymondham  Deep Lane track, off Tuttles Lane, Wymondham, NR18 0JQ Redmoore Meadow Dog Field, Saham Toney  Saham Toney, Thetford, IP25 6RR Greenwood Barn, Ridlington  Mill Common Rd, North Walsham, NR28 9TX Manor Farm Dog Meadow, Oxwick  Manor Farm, Oxwick, Fakenham, NR217HZ FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "Paula’s Pawsome Dog Park, The Heywood",
    "sourceUrl": "https://britishdogfields.com/item/paulas-pawsome-dog-park/",
    "strategy": "direct_url_1",
    "hasAboutText": true,
    "detailsCount": 11
  },
  {
    "fieldId": "695fa7f5d3c46bff55a805eb",
    "fieldName": "Zero’s Play Zone",
    "currentDescription": "Higher Frogwell Field, Frogwell Rd, Callington",
    "newDescription": "Photos © Zero’s Play Zone All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Google Terms Report a map error Plan My Route Here are some other dog fields in the area: Charwell Dog Adventures, Agility Field, Callington  Charwell, Cadson Lane, Callington, PL17 7HW Polgoda Dogs Exercise Field, Zelah  Polgoda Cottage, Zelah, TR4 9HA Stithians Dog Park, Cornwall  Stithians, Cornwall Paws at Presingoll Farm, St Agnes  St Agnes, Cornwall, TR5 0PB Slade Park Secure Dog Walking Field, Bodmin  Slade Park – Secure Dog Paddock Tretoil Bodmin PL30 5BA Dogs Run For Fun Field, Redruth  Sea View Farm TR16 4JA Redruth Charwell Dog Adventures, Adventure Field, Callington  Charwell, Cadson Lane, Callington, PL17 7HW Lebanon Cottage, St Just  Church Street, St Just, Cornwall, TR19 7HA Moorgate Dog Walking Field, Camelford  Advent, Camelford, PL32 9QH Ultimutt Freedom Dog Park, St Erth  Battery Mill Lane, St Erth, Hayle, TR27 6JU Unleashed, Dog Field, Wadebridge  Piggy Lane, Wadebridge, Cornwall Charwell Dog Adventures, Enrichment Field, Callington  Charwell, Cadson Lane, Callington, PL17 7HW Charwell Dog Adventures, Agility Field, Callington  Charwell, Cadson Lane, Callington, PL17 7HW Polgoda Dogs Exercise Field, Zelah  Polgoda Cottage, Zelah, TR4 9HA Stithians Dog Park, Cornwall  Stithians, Cornwall Paws at Presingoll Farm, St Agnes  St Agnes, Cornwall, TR5 0PB Slade Park Secure Dog Walking Field, Bodmin  Slade Park – Secure Dog Paddock Tretoil Bodmin PL30 5BA Dogs Run For Fun Field, Redruth  Sea View Farm TR16 4JA Redruth Charwell Dog Adventures, Adventure Field, Callington  Charwell, Cadson Lane, Callington, PL17 7HW Lebanon Cottage, St Just  Church Street, St Just, Cornwall, TR19 7HA Moorgate Dog Walking Field, Camelford  Advent, Camelford, PL32 9QH Ultimutt Freedom Dog Park, St Erth  Battery Mill Lane, St Erth, Hayle, TR27 6JU Unleashed, Dog Field, Wadebridge  Piggy Lane, Wadebridge, Cornwall Charwell Dog Adventures, Enrichment Field, Callington  Charwell, Cadson Lane, Callington, PL17 7HW FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "Zero’s Play Zone, Callington",
    "sourceUrl": "https://britishdogfields.com/item/zeros-play-zone/",
    "strategy": "direct_url_1",
    "hasAboutText": true,
    "detailsCount": 6
  },
  {
    "fieldId": "695fa7f5d3c46bff55a805ec",
    "fieldName": "Rafferty’s Field",
    "currentDescription": "Florence Road, Callington, PL17 8EA",
    "newDescription": "Photos © Rafferty’s All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Google Terms Report a map error Plan My Route Here are some other dog fields in the area: Knightswood Welly Walk – Kingfisher's Rest, Newquay  Knightswood Equestrian Centre, Whitecross, Newquay, TR8 4LW Hugus Hounds, Threemilestone  Hugus Farm, Besore, Threemilestone, TR3 6BL Charwell Dog Adventures, Agility Field, Callington  Charwell, Cadson Lane, Callington, PL17 7HW Paws n Hooves Dog Field, Callington  Sevenstones, Callington, Cornwall, PL17 8HZ Allet Dog Paddock, Truro  Chynoweth Farm, Allet, Truro, TR4 9DG Pig and Pooch, Coombe  Dowgas, Coombe, Saint Austell Off the Lead, Lanivet  Truro Road, Lanivet, Bodmin, Cornwall, PL30 5JB Wingz K9 Secure Paddock, Par  Wingz Bird & Animal Sanctuary, Lower Gate, Treesmill PL24 2TX Field of Dreams, Launceston  Langdon Cross, Launceston, PL15 8NL Coopers RSPCA Venton Centre, St Columb  Higher Quoit Animal Centre, TR9 6JS Charwell Dog Adventures, Adventure Field, Callington  Charwell, Cadson Lane, Callington, PL17 7HW Ultimutt Freedom Dog Park, St Erth  Battery Mill Lane, St Erth, Hayle, TR27 6JU Knightswood Welly Walk – Kingfisher's Rest, Newquay  Knightswood Equestrian Centre, Whitecross, Newquay, TR8 4LW Hugus Hounds, Threemilestone  Hugus Farm, Besore, Threemilestone, TR3 6BL Charwell Dog Adventures, Agility Field, Callington  Charwell, Cadson Lane, Callington, PL17 7HW Paws n Hooves Dog Field, Callington  Sevenstones, Callington, Cornwall, PL17 8HZ Allet Dog Paddock, Truro  Chynoweth Farm, Allet, Truro, TR4 9DG Pig and Pooch, Coombe  Dowgas, Coombe, Saint Austell Off the Lead, Lanivet  Truro Road, Lanivet, Bodmin, Cornwall, PL30 5JB Wingz K9 Secure Paddock, Par  Wingz Bird & Animal Sanctuary, Lower Gate, Treesmill PL24 2TX Field of Dreams, Launceston  Langdon Cross, Launceston, PL15 8NL Coopers RSPCA Venton Centre, St Columb  Higher Quoit Animal Centre, TR9 6JS Charwell Dog Adventures, Adventure Field, Callington  Charwell, Cadson Lane, Callington, PL17 7HW Ultimutt Freedom Dog Park, St Erth  Battery Mill Lane, St Erth, Hayle, TR27 6JU FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "Rafferty’s Field, Callington",
    "sourceUrl": "https://britishdogfields.com/item/raffertys-field/",
    "strategy": "direct_url_1",
    "hasAboutText": true,
    "detailsCount": 6
  },
  {
    "fieldId": "695fa7f5d3c46bff55a805ed",
    "fieldName": "Humphrey’s Happy Hounds Dog Field",
    "currentDescription": "94 Shepherds Hill, Harold Wood, RM3 0NJ",
    "newDescription": "Media © Humphrey’s Happy Hounds All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Google Terms Report a map error Plan My Route Here are some other dog fields in the area: Mutleys Crew Dog Field, Keston  Holmshaw Farm, Layhams Rd, Keston, BR2 6AR Grow Walkies Dog Field (3 fields), Barnet  Lower Kitts End Farm, Kitts End Road, Barnet, EN5 4RL FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "Humphrey’s Happy Hounds Dog Field, Harold Wood",
    "sourceUrl": "https://britishdogfields.com/item/humphreys-happy-hounds/",
    "strategy": "direct_url_2",
    "hasAboutText": true,
    "detailsCount": 12
  },
  {
    "fieldId": "695fa7f7d3c46bff55a805f5",
    "fieldName": "Glebe Farm ‘No Need For A Lead’",
    "currentDescription": "Birchley Heath Road, Nuneaton, CV10 0QY",
    "newDescription": "Photos © Glebe Farm Official British Dog Fields Partner: All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Google Terms Report a map error Plan My Route Here are some other dog fields in the area: Melody's Meadows  Stretton Lane, Wolston, Coventry, Cv83FR Liberty Dog Fields, Connie's Corner  B80 7EE Greengate Dog Field, Dunchurch  Main Street, Thurlaston, CV23 9JS REVIEW: Horse Meadow Dog Field, Ettington  Grove Farm, Ettington Meriden Dog Training and Exercise Paddock  Kinwalsey Lane, Coventry, CV7 7HT REVIEW: XPC Enclosed Dog Walking Field  CV37 0LP Twister's Barn, Dog Arena, Ettington  Grove Farm, Ettington Glebe Farm  Moreton Morrell Westcote Ley Dog Field, Radway  Westcote Ley, Tysoe Road, Radway, Warwickshire, CV35 0BS Stretton Secure Dog Walking Field , Fosse Way  Fosse Way, Stretton under Fosse, Rugby CV23 0PR REVIEW: Puppy's Corner Secure Dog Field, Ettington  Grove Farm, Ettington Leamington Dog Field, Leamington Spa  Harbury Lane, Leamington Spa, CV33 9QB Melody's Meadows  Stretton Lane, Wolston, Coventry, Cv83FR Liberty Dog Fields, Connie's Corner  B80 7EE Greengate Dog Field, Dunchurch  Main Street, Thurlaston, CV23 9JS REVIEW: Horse Meadow Dog Field, Ettington  Grove Farm, Ettington Meriden Dog Training and Exercise Paddock  Kinwalsey Lane, Coventry, CV7 7HT REVIEW: XPC Enclosed Dog Walking Field  CV37 0LP Twister's Barn, Dog Arena, Ettington  Grove Farm, Ettington Glebe Farm  Moreton Morrell Westcote Ley Dog Field, Radway  Westcote Ley, Tysoe Road, Radway, Warwickshire, CV35 0BS Stretton Secure Dog Walking Field , Fosse Way  Fosse Way, Stretton under Fosse, Rugby CV23 0PR REVIEW: Puppy's Corner Secure Dog Field, Ettington  Grove Farm, Ettington Leamington Dog Field, Leamington Spa  Harbury Lane, Leamington Spa, CV33 9QB FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "Glebe Farm No Need For A Lead",
    "sourceUrl": "https://britishdogfields.com/item/glebe-farm-no-need-for-a-lead/",
    "strategy": "search_q2",
    "hasAboutText": true,
    "detailsCount": 6
  },
  {
    "fieldId": "695fa7f7d3c46bff55a805f8",
    "fieldName": "Bark ‘N’ Go Dog Field",
    "currentDescription": "Whitecraigs Road, Whitehill Ind. Estate, Glenrothes, KY6 2RX",
    "newDescription": "All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Terms Report a map error Plan My Route Here are some other dog fields in the area: Tom and Ted’s, Mersea Island  CO5 7QL Freya's Meadow, Dog Field, Harlow  Latton Street, Harlow, Essex, CM20 3SD Blasford Hill Dog Walking Field, Chelmsford  Blasford Hill Fisheries, Little Waltham ** CLOSED** Dolly's Dog Field, Saffron Walden  Rickling Road, Wicken Bonhunt, CB11 3UH Foxes Farm Fields, Dog Field, Great Bromley  Hilliards Road, CO7 7US Freedom For Your Dog (Dog Field), Braintree  Fairy Hall Animal Feeds and Field Maintenance, Rayne, Braintree, CM77 6TA Beechwoofs Dog Field, Chelmsford  The Wheatsheaf Centre, Main Road, Rettendon Common, Chelmsford, CM3 8DY Foxes Farm Fields, Dog Field, Colne Engaine  Mill Lane, Colne Engaine, Halstead, Essex, CO6 2HX Crazy Dogs Forest Adventure, Dog Field, Takeley  Takeley, CM22 7TF Dog Dynasty, Dog Field, Chelmsford  Lodge Road, Bicknacre, Chelmsford, CM3 4HG Run Wild Dog Park, Danbury  Wild Run, Runsell Lane, Danbury, CM3 4PF Caidge Canines Meadow Hire (Dog Field), Southminster  Caidge Farm, Scotts Hill, Southminster, CM0 7BG Tom and Ted’s, Mersea Island  CO5 7QL Freya's Meadow, Dog Field, Harlow  Latton Street, Harlow, Essex, CM20 3SD Blasford Hill Dog Walking Field, Chelmsford  Blasford Hill Fisheries, Little Waltham ** CLOSED** Dolly's Dog Field, Saffron Walden  Rickling Road, Wicken Bonhunt, CB11 3UH Foxes Farm Fields, Dog Field, Great Bromley  Hilliards Road, CO7 7US Freedom For Your Dog (Dog Field), Braintree  Fairy Hall Animal Feeds and Field Maintenance, Rayne, Braintree, CM77 6TA Beechwoofs Dog Field, Chelmsford  The Wheatsheaf Centre, Main Road, Rettendon Common, Chelmsford, CM3 8DY Foxes Farm Fields, Dog Field, Colne Engaine  Mill Lane, Colne Engaine, Halstead, Essex, CO6 2HX Crazy Dogs Forest Adventure, Dog Field, Takeley  Takeley, CM22 7TF Dog Dynasty, Dog Field, Chelmsford  Lodge Road, Bicknacre, Chelmsford, CM3 4HG Run Wild Dog Park, Danbury  Wild Run, Runsell Lane, Danbury, CM3 4PF Caidge Canines Meadow Hire (Dog Field), Southminster  Caidge Farm, Scotts Hill, Southminster, CM0 7BG FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "Nosey Barker Dog Field Harlow",
    "sourceUrl": "https://britishdogfields.com/item/nosey-barker-dog-field-harlow/",
    "strategy": "search_q3",
    "hasAboutText": true,
    "detailsCount": 6
  },
  {
    "fieldId": "695fa7f8d3c46bff55a805fb",
    "fieldName": "Poppy’s Play Park (field 1)",
    "currentDescription": "Barville Road, Tilmanstone, Deal, CT15 5BQ",
    "newDescription": "Field 2 details Photos: © Poppy’s Play Park All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Terms Report a map error Plan My Route Here are some other dog fields in the area: Ightham Dog Paddock, Ightham  Manor Farm, Oldbury, Ightham, Sevenoaks TN15 9DG Tiggy's Paw Park, Maidstone  Emmet Hill Lane, Laddingford, Maidstone, Kent, ME186BG Mutley Meadows Dog Fields, Sittingbourne  Mutley Meadows, Pear Tree Farm, Yaugher Lane, Sittingbourne, ME9 7XE Hugo's Fun Fields, Whitstable Secure Dog Field Kent, Edenbridge  Lydens Lane, Edenbridge, TN8 7EP Fido's Secure Dog Field, Canterbury  Honey Hill, Blean, CT2 9JR Happy Paws Dog Field, Sheerness  Rear of Allbart Ltd, New Road, Sheerness , ME121AU Yogi's Field, Kent  High Weald, Benenden, Kent, TN17 4ET Puppy Dog Tails Dog Field, Rochester  High St, Wouldham, Rochester, ME1 3TR The Big Barn – The Fun Field Secure Dog Field, Hailsham  Slyes Farm, Rickney Lane, Downash, East Sussex, BN27 2RP 4-All Dog Park, Dover  Ferne lane , Ewell Minnis, Dover, Kent, CT15 7FF Royal Hounds Dog Parks (Arena 1), Gravesend  Meopham, Gravesend, DA13 0XT Ightham Dog Paddock, Ightham  Manor Farm, Oldbury, Ightham, Sevenoaks TN15 9DG Tiggy's Paw Park, Maidstone  Emmet Hill Lane, Laddingford, Maidstone, Kent, ME186BG Mutley Meadows Dog Fields, Sittingbourne  Mutley Meadows, Pear Tree Farm, Yaugher Lane, Sittingbourne, ME9 7XE Hugo's Fun Fields, Whitstable Secure Dog Field Kent, Edenbridge  Lydens Lane, Edenbridge, TN8 7EP Fido's Secure Dog Field, Canterbury  Honey Hill, Blean, CT2 9JR Happy Paws Dog Field, Sheerness  Rear of Allbart Ltd, New Road, Sheerness , ME121AU Yogi's Field, Kent  High Weald, Benenden, Kent, TN17 4ET Puppy Dog Tails Dog Field, Rochester  High St, Wouldham, Rochester, ME1 3TR The Big Barn – The Fun Field Secure Dog Field, Hailsham  Slyes Farm, Rickney Lane, Downash, East Sussex, BN27 2RP 4-All Dog Park, Dover  Ferne lane , Ewell Minnis, Dover, Kent, CT15 7FF Royal Hounds Dog Parks (Arena 1), Gravesend  Meopham, Gravesend, DA13 0XT FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "Poppys Play Park",
    "sourceUrl": "https://britishdogfields.com/item/poppys-play-park/",
    "strategy": "search_q2",
    "hasAboutText": true,
    "detailsCount": 11
  },
  {
    "fieldId": "695fa7f8d3c46bff55a805fe",
    "fieldName": "Barker’s Unleashed",
    "currentDescription": "Southdown Hill, Brixham, TQ5 0AJ",
    "newDescription": "Photos: © Barker’s Unleashed All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Google Terms Report a map error Plan My Route Here are some other dog fields in the area: Woofworthy Dog Field, Holsworthy  Holland Park Farm, Winterland Lane, Holsworthy, EX22 6NF Skern View Secure Dog Field, Bideford  Burrows Lane, Appledore, Bideford, North Devon, EX39 1NL Dog and Dash Plymouth  Hams Field, Upton, Kingsbridge, TQ7 3JF Paws 4 Play, All Weather Dog Paddock, Cullompton  Woodend, Mutterton, Cullompton, EX15 1RN Winkleigh Wag and Walk Dog Field, Winkleigh  Moortown Farm, Winkleigh, EX19 8HA Wanderlust Walkies Totnes  Rook Farm, Littlehempston, Totnes, TQ9 6NA The Dog Park Hemyock, Hemyock  Culmbridge Farm Hemyock Cullompton Devon EX15 3PD Hounds Unleashed, Ivybridge  Hounds Unleashed, Ivybridge Blackdown Hills Dog Park, Honiton  Golden Cleeve, Sheldon, EX14 4QW Safe Hounds Dog Park, Torrington  Weare Trees Hill, Torrington, EX38 7EZ BLACKDOG Freedom Adventures  North Cockerham, Hacche Lane, South Molton, EX36 3EH Bampton Bark Park, Tiverton  High Cross, Bampton, Devon, EX16 9LA Woofworthy Dog Field, Holsworthy  Holland Park Farm, Winterland Lane, Holsworthy, EX22 6NF Skern View Secure Dog Field, Bideford  Burrows Lane, Appledore, Bideford, North Devon, EX39 1NL Dog and Dash Plymouth  Hams Field, Upton, Kingsbridge, TQ7 3JF Paws 4 Play, All Weather Dog Paddock, Cullompton  Woodend, Mutterton, Cullompton, EX15 1RN Winkleigh Wag and Walk Dog Field, Winkleigh  Moortown Farm, Winkleigh, EX19 8HA Wanderlust Walkies Totnes  Rook Farm, Littlehempston, Totnes, TQ9 6NA The Dog Park Hemyock, Hemyock  Culmbridge Farm Hemyock Cullompton Devon EX15 3PD Hounds Unleashed, Ivybridge  Hounds Unleashed, Ivybridge Blackdown Hills Dog Park, Honiton  Golden Cleeve, Sheldon, EX14 4QW Safe Hounds Dog Park, Torrington  Weare Trees Hill, Torrington, EX38 7EZ BLACKDOG Freedom Adventures  North Cockerham, Hacche Lane, South Molton, EX36 3EH Bampton Bark Park, Tiverton  High Cross, Bampton, Devon, EX16 9LA FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "Barkers Unleashed Brixham",
    "sourceUrl": "https://britishdogfields.com/item/barkers-unleashed-brixham/",
    "strategy": "search_q2",
    "hasAboutText": true,
    "detailsCount": 9
  },
  {
    "fieldId": "695fa7fcd3c46bff55a80613",
    "fieldName": "Chester’s Dog Walking Field",
    "currentDescription": "6 Royalty Ave, New Longton, Preston, PR4 4JN",
    "newDescription": "Field Notes The Bark Park of Higham is just over an acre dog field set in a Countryside setting. Fully equipped with 6-foot enclosed fences, tyres tunnel, jumping logs, a shelter for rain protection, sand pit for your dog’s enjoyment, posing platforms, and a water station. We also have in field parking and a seating area. The field is located within an enclosed 10 acre of farm land. There is a double gate entry with first gate at top of track. The field is located at end of track with own gate which has to be locked at all times. Parking is then within the dog field. All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Terms Report a map error Plan My Route Here are some other dog fields in the area: Hollin Wood, Maidstone  Ashford Road, Maidstone, ME171PZ Hugo’s Fun Dog Fields (Dunkirk), Canterbury  Dunkirk, ME13 9LE Spring Rise Canine Care Secure Dog Field, Etchinghill  CT18 8BZ Mocketts Dog Field, Isle of Sheppey  Mocketts Farm, Harty Ferry Road, Isle of Sheppey, ME124BQ Canine Connection Secure Dog Fields, Sittingbourne  Breach Lane, Newington, Sittingbourne, ME9 7PL East Kent Dog Fields, Faversham  Staplestreet, Hernhill, Faversham , Hernhill, ME13 9HY Happy Hound Secure Dog Field, Adisham  196 The St, Adisham, Canterbury, CT3 3LD Tiggy's Paw Park, Maidstone  Emmet Hill Lane, Laddingford, Maidstone, Kent, ME186BG Secure Dog Field Kent, Edenbridge  Lydens Lane, Edenbridge, TN8 7EP Horlands Farm, Maidstone  Horlands Farm, Summerhill Road, Marden, TN12 9DB Royal Hounds Dog Parks (Arena 2), Gravesend  Meopham, Gravesend, DA13 0XT Paw Dog Training – Dog Field, Romney Marsh  Street Farm Cottage, The Street, Newchurch, Romney Marsh, TN29 0DZ Hollin Wood, Maidstone  Ashford Road, Maidstone, ME171PZ Hugo’s Fun Dog Fields (Dunkirk), Canterbury  Dunkirk, ME13 9LE Spring Rise Canine Care Secure Dog Field, Etchinghill  CT18 8BZ Mocketts Dog Field, Isle of Sheppey  Mocketts Farm, Harty Ferry Road, Isle of Sheppey, ME124BQ Canine Connection Secure Dog Fields, Sittingbourne  Breach Lane, Newington, Sittingbourne, ME9 7PL East Kent Dog Fields, Faversham  Staplestreet, Hernhill, Faversham , Hernhill, ME13 9HY Happy Hound Secure Dog Field, Adisham  196 The St, Adisham, Canterbury, CT3 3LD Tiggy's Paw Park, Maidstone  Emmet Hill Lane, Laddingford, Maidstone, Kent, ME186BG Secure Dog Field Kent, Edenbridge  Lydens Lane, Edenbridge, TN8 7EP Horlands Farm, Maidstone  Horlands Farm, Summerhill Road, Marden, TN12 9DB Royal Hounds Dog Parks (Arena 2), Gravesend  Meopham, Gravesend, DA13 0XT Paw Dog Training – Dog Field, Romney Marsh  Street Farm Cottage, The Street, Newchurch, Romney Marsh, TN29 0DZ FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "Bark Park Of Higham Dog Field Rochester",
    "sourceUrl": "https://britishdogfields.com/item/bark-park-of-higham-dog-field-rochester/",
    "strategy": "search_q3",
    "hasAboutText": true,
    "detailsCount": 13
  },
  {
    "fieldId": "695fa7fcd3c46bff55a80614",
    "fieldName": "Eva’s Green Dog Walking Field",
    "currentDescription": "Clover Hill Farm, Steart Lane, Somerton, TA11 7BD",
    "newDescription": "Creaton Dog Walking Park is a secure dog walking field 8 miles north of Northampton with beautiful views of the Northamptonshire countryside. This dog field is approximately 1 acre and fenced to just over 6ft all round with deer fencing and rabbit mesh at the based so suitable for the smallest dogs. Booking and Accessing Creaton Dog Walking Park Booking Creaton Dog Walking Park is very simple through a secure online booking system and you will receive a booking confirmation via email. There isn’t a lock on the field gate so no code is required. Access to the field is very straight forward and both Google Maps and the what3words listed here will take you to the farm entrance. There is also a sign on the main road. Once on the farm road you will see the field in front of you. The is secure parking both within the airlock and within the field itself – this is well secured with over 6ft weld mesh gates. What is Creaton Dog Park like? This is a great exercise paddock – at around 1 acre (square shape) it has plenty of space to throw a ball. There is a log in the field and some weave poles but you might want bring toys for enrichment. The grass is thick and kept short so is suitable for buggies and people who aren’t very steady on their feet. There are lovely views for miles over the countryside from this elevated position so you might need extra layers on cold days! Is Creaton Dog Walking Park Secure? This field is surrounded with just over 6ft deer fencing with rabbit mesh at the base. Access is through a set of two 6ft welded mesh vehicle gates. Useful Information About Creaton Dog Walking Park Easy to access and centrally located Very good value at £8.50 per hour for up to 3 dogs Lovely views over countryside and farmland Use the What3Words location for the main farm entrance as this is not signposted at the entrance There is no water so bring a bowl but there is a dog waste bin and there are bags available Notes For Reactive Dog Owners For any movement reactive dogs, there is a relatively busy main road within ear shot and eye sight through the hedge – this will not be visible when the hedge is in full leaf but can be seen in early spring when we visited The farm road passes the field and several cars passed during our visit In the very far distance there is a used footpath across the surrounding field – no doubt not visible when the crops are up but a consideration for any sight hounds with a high alter-ness Photos: © British Dog Fields All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Terms Report a map error Plan My Route Here are some other dog fields in the area: Harkers Barkers Secure Paddocks, Little Oakley Corby  Cobley Lodge Farm, Little Oakley Corby, NN18 8HE Cherry Meadows Secure Dog Field, Middleton Cheney  Chacombe Road, Middleton Cheney, Banbury, OX17 2EN Moulton Secure Dog Walking Field, Moulton  Moulton Rd, Moulton, Northampton, NN3 7QN West Haddon Dog Field, West Haddon  Northampton Road, NN6 7DG Cranford Dog Walking Meadow, Kettering  Cranford Road, Cranford, Kettering, NN14 4AF Broadacres Dog Field, Northampton  NN7 1AW Hemington Dog Park, Peterborough  Hemington Lodge Farm, Hemington, Peterborough, PE8 5QP Rainbow's End Farm, Stanwick  Stanwick, Wellingborough, NN9 6TZ REVIEW: Hinton-in-the-Hedges Dog Walking Field, Brackley  Hinton Road, Hinton-in-the-Hedges, Brackley, NN13 5NF REVIEW: Braunston Secure Dog Walking Field, Daventry  Welton Road, Braunston, Near Daventry, NN11 7JG REVIEW: Vale K9, Dog Field, Crick  NN6 7NE, Crick Lodge Farm Paddocks, Corby  NN17 3EQ Harkers Barkers Secure Paddocks, Little Oakley Corby  Cobley Lodge Farm, Little Oakley Corby, NN18 8HE Cherry Meadows Secure Dog Field, Middleton Cheney  Chacombe Road, Middleton Cheney, Banbury, OX17 2EN Moulton Secure Dog Walking Field, Moulton  Moulton Rd, Moulton, Northampton, NN3 7QN West Haddon Dog Field, West Haddon  Northampton Road, NN6 7DG Cranford Dog Walking Meadow, Kettering  Cranford Road, Cranford, Kettering, NN14 4AF Broadacres Dog Field, Northampton  NN7 1AW Hemington Dog Park, Peterborough  Hemington Lodge Farm, Hemington, Peterborough, PE8 5QP Rainbow's End Farm, Stanwick  Stanwick, Wellingborough, NN9 6TZ REVIEW: Hinton-in-the-Hedges Dog Walking Field, Brackley  Hinton Road, Hinton-in-the-Hedges, Brackley, NN13 5NF REVIEW: Braunston Secure Dog Walking Field, Daventry  Welton Road, Braunston, Near Daventry, NN11 7JG REVIEW: Vale K9, Dog Field, Crick  NN6 7NE, Crick Lodge Farm Paddocks, Corby  NN17 3EQ FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "Creaton Dog Walking Park",
    "sourceUrl": "https://britishdogfields.com/item/creaton-dog-walking-park/",
    "strategy": "search_q3",
    "hasAboutText": true,
    "detailsCount": 9
  },
  {
    "fieldId": "695fa7fcd3c46bff55a80615",
    "fieldName": "Out n Safe Dog Field",
    "currentDescription": "Portcullis Estate, Glasgow, G66 8AQ",
    "newDescription": "Field Owner Notes A large 3 acre field close to Bungay on the road to Beccles, within a large agricultural field. Easy to get to and 2 minutes drive from Bungay and 10 minutes from Beccles. The nearest postcode is NR35 1TW. ​NOTE: This field has no water. The fields have 6ft high Stock fencing and gate with a hard-standing area within the field for your vehicle so you can safely let out your dog without having to bother with leads. The fields typically have seating, drinking water (not all) and emergency poo bags. It is available for booking by the hour and is for your exclusive use. All media is the copyright of the listed facility or where reviewed the copyright of British Dog Fields. All rights reserved. LOCATION ON MAP Map Satellite Keyboard shortcuts Map data ©2026 Google Terms Report a map error Plan My Route Here are some other dog fields in the area: Murfield Meadow Secure Dog Field, Hadleigh  Benton End Street, Hadleigh, IP7 5JR Prospect Meadow Dog Field, Sudbury  Great Cornard, Sudbury, CO10 0PQ Stowupland Dog Meadow, Stowupland  Stowupland Dog Meadow Stowupland Stowmarket Suffolk IP14 4BN The Paw Pad, Sudbury  The Paw Pad, Sudbury, Suffolk, United Kingdom Woodland Walkies, Mildenhall  Thicketts Road, Mildenhall, Wiltshire, SN8 2FJ Hanchett Meadow – The Meadow Dog Field, Haverhill  Hanchett End, Haverhill, Suffolk, CB9 7RP Bow Wow Adventure Playground for Dogs, Bury St Edmunds  Skippers Farm, Cocks Green Lane, Bury St Edmunds, IP30 0UE Safe and Secure Dog Field, Carlton  Vale Farm, Carlton, Suffolk, IP17 2QN Kenny Hill Dog Adventure Park, Kenny Hill  Kenny Hill Farm, Kenny Hill, Bury St Edmunds, Suffolk IP28 8DU Warren Dog Park, Newmarket  Warren Farm, Kennett, Newmarket, Suffolk CB8 7QP Walkies Dog Walking Paddock, Tuddenham  Grundisburgh Rd, Ipswich, IP6 9DD Freckenham Secure Dog Field, Newmarket  Fordham Road, Freckenham, IP28 8JB Murfield Meadow Secure Dog Field, Hadleigh  Benton End Street, Hadleigh, IP7 5JR Prospect Meadow Dog Field, Sudbury  Great Cornard, Sudbury, CO10 0PQ Stowupland Dog Meadow, Stowupland  Stowupland Dog Meadow Stowupland Stowmarket Suffolk IP14 4BN The Paw Pad, Sudbury  The Paw Pad, Sudbury, Suffolk, United Kingdom Woodland Walkies, Mildenhall  Thicketts Road, Mildenhall, Wiltshire, SN8 2FJ Hanchett Meadow – The Meadow Dog Field, Haverhill  Hanchett End, Haverhill, Suffolk, CB9 7RP Bow Wow Adventure Playground for Dogs, Bury St Edmunds  Skippers Farm, Cocks Green Lane, Bury St Edmunds, IP30 0UE Safe and Secure Dog Field, Carlton  Vale Farm, Carlton, Suffolk, IP17 2QN Kenny Hill Dog Adventure Park, Kenny Hill  Kenny Hill Farm, Kenny Hill, Bury St Edmunds, Suffolk IP28 8DU Warren Dog Park, Newmarket  Warren Farm, Kennett, Newmarket, Suffolk CB8 7QP Walkies Dog Walking Paddock, Tuddenham  Grundisburgh Rd, Ipswich, IP6 9DD Freckenham Secure Dog Field, Newmarket  Fordham Road, Freckenham, IP28 8JB FIND A FIELD Search keyword Category Select Category Location Select Location Search by geolocation Search Leave a review Your email address will not be published. Required fields are marked * Your rating *      Your review * Name *",
    "matchedName": "The Dog Walking Field Bungay",
    "sourceUrl": "https://britishdogfields.com/item/the-dog-walking-field-bungay/",
    "strategy": "search_q1",
    "hasAboutText": true,
    "detailsCount": 10
  }
]